#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-staging/runs/run-wjp8YM4dpRWPUSJx

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_staging]
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_user.packer: Refreshing state... [id=packer_staging]
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.staging]
aws_sqs_queue.image_builder_pozorbot: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/933752197999/image-builder-pozorbot-staging.fifo]
aws_cloudwatch_log_group.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_staging]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_staging]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_staging]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_staging]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_staging]
aws_iam_role.pozorbot_lambda_role: Refreshing state... [id=pozorbot_lambda_role_staging]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_staging]
aws_iam_role.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_role.external_composer: Refreshing state... [id=external_composer_staging]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=internal_composer_syslog]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_staging-20210121192045197600000002]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-084607083aaa39727]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-08d5fdb7cd26e5c94]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-0249da6b762fae5de]
aws_security_group.external_workers: Refreshing state... [id=sg-0f578bf2872026f5d]
aws_security_group.external_vpc_endpoints: Refreshing state... [id=sg-0be443e4c92c98b1c]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-0eb65fd8f2c17dba5]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_policy.external_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_worker_read_keys_staging]
aws_iam_policy.external_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_composer_read_keys_staging]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_staging]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_staging]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_staging-20210121192044923500000001]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_staging-20210121192045244900000003]
aws_lambda_function.pozorbot_lambda: Refreshing state... [id=pozorbot_staging]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656553800000004]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656385800000003]
aws_iam_instance_profile.external_composer: Refreshing state... [id=external_composer_staging]
aws_cloudwatch_log_stream.external_composer_syslog: Refreshing state... [id=external_composer_syslog]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_staging-20201204204656365500000001]
aws_iam_instance_profile.external_worker: Refreshing state... [id=external_worker_staging]
aws_security_group.external_composer: Refreshing state... [id=sg-0be4cfbfac3cc0022]
aws_vpc_endpoint.external_vpc_cloudwatch_logs: Refreshing state... [id=vpce-0ffb71834c608a4e5]
aws_vpc_endpoint.external_vpc_secretsmanager: Refreshing state... [id=vpce-013676c2939c3d681]
aws_vpc_endpoint.internal_vpc_secretsmanager: Refreshing state... [id=vpce-0d13154306549b1cd]
aws_vpc_endpoint.internal_vpc_cloudwatch_logs: Refreshing state... [id=vpce-01e031ba5033ab0c5]
aws_iam_role_policy_attachment.external_worker_read_keys: Refreshing state... [id=external_worker_staging-20210113202541913700000002]
aws_iam_role_policy_attachment.external_composer_read_keys: Refreshing state... [id=external_composer_staging-20210113202541907800000001]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_staging-20201204204656366800000002]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_staging-20201204204656559200000005]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-058d1cec56397f102]
aws_network_interface.composer_internal: Refreshing state... [id=eni-07088640399f60f49]
aws_ebs_volume.composer_external: Refreshing state... [id=vol-0daeecfc25da04a05]
aws_network_interface.composer_external: Refreshing state... [id=eni-02f250427cdd85dc7]
aws_iam_policy.external_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_cloudwatch_logging_staging]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_staging]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_staging-2020120420465704850000000b]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_staging-2020120420465704340000000a]
aws_iam_role_policy_attachment.external_cloudwatch_worker: Refreshing state... [id=external_composer_staging-20210113203644029600000002]
aws_iam_role_policy_attachment.external_cloudwatch_composer: Refreshing state... [id=external_worker_staging-20210113203644009900000001]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_staging-2020120420465705150000000c]
aws_instance.composer_external: Refreshing state... [id=i-0654ebbbd69258c54]
aws_eip.lb: Refreshing state... [id=eipalloc-0f8be222c563c4767]
aws_instance.composer_internal: Refreshing state... [id=i-02cfe356a7283027d]
aws_volume_attachment.composer_external: Refreshing state... [id=vai-842948316]
aws_launch_template.worker_external_x86: Refreshing state... [id=lt-0195b4ef20679c780]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-740566457]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-0a23e96f3feb1649c]
aws_spot_fleet_request.workers_external_x86: Refreshing state... [id=sfr-bc17797b-b6b4-4c79-a53f-db08e1ff691f]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-9bf7bea8-2d91-4bb1-b1e1-95c308a14496]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_cloudinit_config.external_workers_cloud_init will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "external_workers_cloud_init"  {
      ~ id            = "242694101" -> (known after apply)
      ~ rendered      = "H4sIAAAAAAAA/9R4WXOrSJr2vSLqP/C5TsTXHWeQWLRY7nJFCwm0koiETJaeCQdLSiBSgCG1njr/fUKLT/ssNd090zflG5vMd8uHJ5/3xcMiZyRnvH0qyRO33VGWlkHFWtv0SOK/cGGxy+OgOj0/6FNdVQwERgPoPTQuTzwmVZ0W+RMnNoWfGj81eP690U+Nt9ijtC6LOmVX24CxIEq2JGd/4VYpJXmwJc8PaZ6yZrRaP/zdy66CvF6RilfzqIjTfP3E9cKUvTO4lszIkbUiWuxiPiryVbr+qaGnW/JdcT+/t2k0djWp6qcGx/HcpYInjkQSf1lscBzH1XXyEuxYUlTpmcQvGTldbS8/PPdQ1wlf1QE3GAwGigzOwVA8RZJ6eRwNzIEyGAyGA3N43Ky06ZSOV8O8n0Z0cto6lapUNpLoossya2yLpOzFw+X5IG68rpMnJl26ekmWVQqOwKXjx8gx+i2olUosnPvaAZw+Zqt10l/tTsBr96cf9aBrnGysrDsJKLTjCrrjTjphUcsyaR6qWjovraxN07Jomz5T2HY9eF1n1qA7OienddjddfR+erSnx7ajbHaWLoxd8ww2JVmdUmf3sZ7Cj4mEKjObD5TdbuqZYbWhH7UEb4PFvtqfbEPa1Qbb556yScLl4WT0JGe5Ccp53OondvC6VMWDduoiTcrdqL1cH4R1aobdOg01+9wDNjk6csfsP76WpuHo3jwq135FrWAymfuWnrCz0dNjvzIWGnILSxyQwam9TlgEKkOxadix9suefD4LrwrUpGhotA3hUHYOh9dlsj9IOQvl0l4sWUzY7CPuCOYyL3P3ZFm5X0pn7RARSQzdY7eXJ32aJ4vKX29ILyrMfDnQjq2Iyl3Vmp3W6W4ZKYePmfjo7ainu+g1UFh2mC0yuBmVG9uVSEefid1i1Ktnk6jdcjrZabXYx3qNk/hVHLqTMcZGeS7WodDvYC8VoKuVuQ9bIsHrYQt+dPCJeSvvUahW2IjiQSGN/VU+65w9iNzZrK/7WZAfj7LaQ0aaqTPQr9FGEoRzd3g6CdPV9NUOZ6LSWfVWsRxEsFq0R5GHYm3aEpUTcLqauOlFfjoYG7M5CM+uJtgyWz0eBSKaz8/cNtgU1V8rEicBa0bF9uFrvpNY6nTE/pXzwxvnqT+aisBWO5e16VIRNxptl13NVtLjxO4ejKzrPuablt8jxRKYaksXDvP2Y2fOFeEuDtKvkjUOVcrIy0UR7teyDFjyxLXYtrxd75eLRrzsg6q+VhbdVOCJ++1eqGEpaLoYvQwNXZ/az49yFKweBYF0pI7UDttie9VbdcJVJyBCLEd9UYoe+2JfunsPDX1pWCp8c++tOkTuxnG//Sh2hFUQtUNB7srdqBvL/TDsdYlEHsV49W3ywctQhfbzwhLYwhKHEMUzO1VGEM+QhfyZKWgIXvcENszEmYWgilUwMh3f9QVNttBM8QWK0QiYuuSdAVbGKOuIoeQLZKt37FEmwXGCQgkqsQChg8pFKJazYOJv7EyDEB3mJtWUWPBfIcbAzOjEtDUMkSbHwjHVhU7pa3EdieUIuP4mdIBsjZONnYmvphsvsYq7NoY+QaKKbeAGY2DYbqnEh/Ky1/5qL9NcG89gLODcQdBBWFOhqgnxVj9ZGy3BclLZY6FDcNk1BaAggcpQ03wrY3sno0W8BcbwWvNsiJCm+lKsIVVTr7ZOf3R5NjMNmLlSOVjzLAx075wsHKcECNOc5Ao0EFB0cbbQt/EUjpSj52rneLOee3i2wZkuAap3/Cw5QoSOATpiR32U9dEMkg0+B1JZ6HJ5tCd0gjaJjKi3X0hgpjvTY7RRMMGl7QnHQBcjGePyZB4KAYzg1pOLs+3SdqiBLhaxj0QlNzO6CMaxYkw0FtHS0p3+1nPgiUywZQ/ZOcx81XJYW5ejyjtrcx/jnb4Fta7F5ZBiwRnNJlD0R5DGwJa0vZ/BytHwCOZ4YU3iOXLisT2BZ0sFgeOAbUxjx9LKAGTtdizEB51qgWNPO945EUNXedXxYI5Uv3ZUve2PtcBWxcTRaAptBVgudHQVTK1ckaFAD15OdyGmKByyM8yxFI7gHo/FE5kUe+Im3UiFEs7EZZRps9As26FUyxHFDE9wBsdYQ+JsaEuxoiMmeki08AQnlqvA8DzLQtk/zs+DI9x6ZxO1TxgBJRawYjqagVVxDN14ijBVh9S3dLU/NCnVYFbIvu17upwd/HG/jqz+3KN+6WW0jCW4Q+KgApk4NNRY0THOLDeGDhKHHtLG1iamgK7PxFayUDrMf8dXefOFbqyZaV9GyAcmEoem47V/fK+OXzhqrksF5qUEJEotIeqEWrmIsunJdsQgULWjpVKdOMfElqkT2ZEMz3Ro4xmCOTg4ORL0yVSGIpQ9ARbxdi1CBPaWpqXD7bGKbcUDqO/5ApScCRhG4/7YmswkXWVLyznaQMRz3fUOYFzvLUpzZxJV4bhEeKLvDbc8hJvEwtsjiyZoDwVxadtojpzZBA2ZEWxwEJ3xFgq+G6ht2banInIYNkazeThJqJVpNXKTqSkdR2iM2ygDwLO1DnAHMh53cmOkLCwaCwQrpmGWApJiYOYDGWBs+c6jABBqI7U8WfngHEzoHmiztoFnEErsRBxgWW68NbNECuQEWFt/F0m67Fh9CThUhJuEEVXsDjdA8LKiMxfKDkSaaE2Ko5fFYoSAN5e1OcIQxcM+DM/eKc5i10NZB4n+wqN628OJbp5nBsi1TeDMjtEGtf0NVK3MnFs5qG3rUY4moBNttD1woeBlsx2gmWi6en+Y3jQZoo46VYGGKJzBjI5MDLWblgvzbzvFxLDs5+BQXxpYWdSkahZ1uEtp3Cyq9bfGg9EIqpb1LPakpiw2u+2mKN5tHAPOVfhiWYuXuepZLwMInoMqfwoO9VNNooqwehvkwZpUT7uaJ0HNePGpL8u9jiT2e/1+/271FFbkcJ1V+Z6GCKH3+BZSrCGcLu2pAV70ARiM721uAEb/+2T1LqyjKi0vUz1/d+GjYrsN8pjPTI8W/bf8nmWr+hUuMNDVlyVUtan7XLNgneZrnhwZqfKA8oeiyu7z9zvgRlP43CIsat3B5d/QfouuDqFqW18OpoLR0pgC+wXBxXPCWFk/tVpfn6z55WTNYBuci/z+Elvv544fpfxuocmKLf3xOPK3rNik/3V/CCgtDiR+iYttkOY198z9jXtgJNi+p8zDf3APyS5sXl7jt+s3bL7f4t4yRAH3zD38uOoo4KOKNUtymbPu1d0C/sv1/dvq+P2vxX/lu+/I1wmh9EbE3/vw+3+tMM1bYVAnjZowjie7givTkqyClDbqYldF5MdjZuNnbkwYxxLCpXnNgjwi3HTUbEyBZQ/AUH2Zjp4//CnaVZTjFzV3IdtTqyV2+02p027ef7dowEjNWlvCAj4OWNB6i8Wn8Z8vOQZ1TbYhJVxS1OzyMdpsaGix+HJhnh8+fPrxHfrMf/j0rpjPzd9To4dLnmWV5owrdrcT5eTwLiGJkoJ7sAhjab7m6lPNyPbLNscK7sOnr2r63LyGtO7wfOPQbLz9FTHK1YTxX0J9+CrMH4MGd3BughdeAPpCB1ZwcAJuYECyTmtGqq8Jc0hZcrVptHZ11aJFFNBrJcGh5r7WJW5NGH9b4vcB3RHuPy+K9LaUxtyHT/9IzD9zv3GbV46vuIemdfWzWJXm6wfu19vp3uv2yz3xy123m5u6yBtv7v+T5cM/GYz7jbsiXm05fvXPFtD4UW+5/+OI4/lgx4o/EnFGpKTFibs0Zm5VVNxNQ+sbae6bF8q8XVxuOOAiUrF0lUYBI81GGNSk2+b4mOO5X375hfvw6ZvPzc/cr9yHT+9b5ud3Yvt7aTJy4oI8/jrXv4WkP5ho/iEvb6hcx5evafj3jYcfW9449gWh76G4OfAZOV3h+CZwVLH/Y+A3nN+R/LvT/PH4eu3hF93+AWsvur8r35k0fuZsY2T8aZsEp5jkf37inEuLIfFFIaMi35Pq0inS+vI8AhZ36YoVd0hIzh0IR4NdHiXNRhSwK8Mf3iF9n5w/v0f/0j8+P3C//vq+hD8QxG+NdlfeceVqUu3TiNzxXVakDCrCfTtC/f+aq8i2YORbt+tFrosoI6xuNm7t+NJ7SR5cJguez4vDl2i3EPd5+6/fwvr02BOE78Dk+Z8a/x0AAP//1TN8dywYAAA=" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ part {
          ~ content      = <<-EOT
                #cloud-config
                
                users:
                  - name: ec2-user
                    ssh_authorized_keys:
                      - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                      - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
                
                write_files:
                  - path: /tmp/cloud_init_vars
                    content: |
                      OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                      COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                      OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                      COMPOSER_HOST=aws.composer.osbuild.org
                      COMPOSER_ADDRESS=172.31.64.11
                      WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                      SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                      SYSTEM_HOSTNAME_PREFIX=staging-external-worker
                      COMPOSER_DIR=/etc/osbuild-composer
                      SECRETS_MANAGER_ENDPOINT_URL=https://secretsmanager.us-east-1.amazonaws.com/
                  - path: /etc/osbuild-composer/osbuild-composer.toml
                    content: |
                      [koji]
                      allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                
                      [worker]
                      allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
            EOT -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
    }

  # data.template_cloudinit_config.internal_workers_cloud_init will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "internal_workers_cloud_init"  {
      ~ id            = "4283587750" -> (known after apply)
      ~ rendered      = "H4sIAAAAAAAA/9R4WXOjSpr2vSLqP/D5VMTXHTVILEKy3McnWkiglUQkJFvPhIMlJRApwJBa69R/n9Diatvlmu6e6ZvjG5vMd8uHJ5/3xYMipzinrHUs8QOz2RKalkFFW5v0gOO/MGGxzeOgOj7eaRNNkXUEhn3o3TXOT6yNqzot8geGb3KfGp8aLPva6FPjJfYwrcuiTunFNqA0iJINzulfmGVKcB5s8ONdmqe0GS1Xd3/3sqogr5e4YpU8KuI0Xz0w3TClrwwuJVN8oK2IFNuYjYp8ma4+NbR0g38o7pfXNo3GtsZV/dBgGJY5V/DA4Ehgz4sNhmGYuk6egi1Niio94fgpw8eL7fmHZe7qOmGrOmD6/X5fFsEpGPDHSFDOj8O+0Zf7/f6gbwwO66U6mZDRcpD30oiMjxunUuTKQgKZd2hmjiwel914sDjt+bXXcfLEIAtXK/GiSsEBuGR0Hzl6rwXVUo65U0/dg+OXbLlKesvtEXjt3uSLFnT0o2XLKykBhXpYQnckpWMatUyD5KGiprPSzNokLYu24VOZblb951Vm9jvDU3JchZ2tpPXSgzU5tB15vTU1buQaJ7Au8fKYOtsv9QR+SQRUGdmsL2+3E88IqzX5oib2Jpjvqt3R0oVtrdNd7snrJFzsj3pXcBbroJzFrV5iBc8Lhd+rxw5ShdyN2ovVnlulRtip01C1Tl1g4YMjSkbv/rk0dEfzZlG58itiBuPxzDe1hJ70rhb7lT5XkVuYfB/3j+1VQiNQ6bJFQsncLbri6cQ9y1AVooHe1rl9Ke33z4tktxdyGoqlNV/QGNPpF1vijEVe5u7RNHO/FE7qPsICH7qHTjdPeiRP5pW/WuNuVBj5oq8eWhERO4o5Pa7S7SKS918y/t7bEk9z0XMg02w/nWdwPSzXlitgSZvynWLYrafjqN1ypOy4nO9irbaT+JkfuOORbevlqViFXE+yvZSDrlrmPmzx2F4NWvCLYx+pt/TuuWpp61HcL4SRv8yn0smDyJ1Oe5qfBfnhICpdpKeZMgW9Gq0Fjjt1BscjN1lOnq1wysvSsruMxSCC1bw9jDwUq5MWLx+B01H5dTfy0/5In85AeHJVzhLp8v7AYd54fGQ2wbqo/lrhOAloMyo2d2/5jmNBkvjehfODK+eJP5zwwFKk89pkIfNrlbTLjmrJ6WFsdfZ61nHv83XL7+JiAQylpXH7WftemjFFuI2D9E2yxr5KKX46K8LtWpYBTR6YFt2U1+v9dNaIp11Q1ZfKoqsKPDC/3wrVTRlN5sOnga5pE+vxXoyC5T3HYUmQhHbY5tvL7lIKl1KAuViMerwQ3ff4nnDzHujaQjcV+OLeXUpY7MRxr33PS9wyiNohJ3bETtSJxV4YdjtYwPd8vHyfvP80UKD1ODc5Ojf5AUTx1ErlIbSnyET+1OBUBC97HB1k/NREULEVMDQc3/U5VTTRVPY5YqMhMDTBOwFbHqFM4kPB5/BGk6xhJsBRgkIByjEHoYPKeciX02Dsr61MhRDtZwZR5Zjzn6FtAyMjY8NSbYhUMeYOqcZJpa/GdcSXQ+D669ABojlK1lbGPxtuvLAVu2PZ0MeIV2wLuMEI6JZbyvG+PO+13+xlqmvZUxhzdu4g6CBbVaCicvFGO5prNbHFpLJGnITtsmNwQEYcEaGq+mZGd05GingD9MGl5ukAIVXxhVhFiqpcbJ3e8PxsZCowcrlybNUzbaB5p2TuOCVANslxLkMdAVnjp3NtE0/gUD54rnqK16uZZ0/XdqYJgGiSnyUHiNAhQAfbUe5FbTiFeG2fAqEsNLE8WGMyRutERMTbzQUw1ZzJIVrLNrZLy+MOgcZHom2XR2NfcGAIN55YnCyXtEMVdGze9hEv50ZG5sEolvWxSiNSmprT23gOPOKxbVoDegozXzEd2tbEqPJO6sy37a22AbWmxuWA2JwznI4h7w8hiYElqDs/g5Wj2kOY23NzHM+QE4+sMTyZCggcB2xiEjumWgYga7djLt5rRA0cayJ5p4QPXflZs/szpPi1o2htf6QGlsInjkpSaMnAdKGjKWBi5rIIObL3crINbYLCAT3B3BbCIdzZI/6Ix8UOu0knUqBgZ/wiytRpaJTtUKjFiNjUHtsZHNkq4qcDS4hlDVHeQ7xpj+3EdGUYnqZZKPqH2al/gBvvZKD20UZAjjlbNhxVtxV+BN14gmyiDIhvakpvYBCiwqwQfcv3NDHb+6NeHZm9mUf80stIGQtwi/h+BTJ+oCuxrNl2ZroxdBA/8JA6MtcxAWR1wpachcJ+9hNf+cUXurFqpD0RIR8YiB8Yjtf++F4dvnPUWJUyzEsBCISYXCSFajmPssnRcvggUNSDqRANO4fEEokTWZEIT2Rg2VMEc7B3csRp44kIeSh6HCzizYqHCOxMVU0Hm0MVW7IHUM/zOSg4YzCIRr2ROZ4KmkIXpnOwAG/PNNfbg1G9MwnJnXFUhaMS2WNtp7vlPlwnpr050GiMdpDjF5aFZsiZjtGA6sHaDqKTvYGc7wZKW7SsCY8cauvD6SwcJ8TM1Bq5ycQQDkM0stsoA8CzVAm4fdEeSbk+lOcmiTlsy4ZulBwSYmDkfRHYtuk79xxAqI2U8mjm/VMwJjugTtu6PYVQoEfsANN0442RJUIgJsDc+NtI0ETH7AnAITxcJxQrfGewBpyXFdKMKyWIVN4cFwcvi/kIAW8mqjNkQxQPejA8ecc4i10PZRLi/blHtLZnJ5pxmuogV9eBMz1Ea9T211AxM2Nm5qC2zHsxGgMpWqs74ELOy6ZbQDLecLXeIL1qMkSSMlGAigicwowMDRuqVy3nZu87xVg3rcdgX58bWFnUuGoWdbhNSdwsqtV74/5wCBXTfOS5psg1+fsmz99MHB3OFPhkmvOnmeKZT30IHoMqfwj29UONowrTehPkwQpXD9uaxUFNWf6hJ4pdSeB73V6vd7N6CCu8v4yqbFdFGJNbfBPJ5gBOFtZEB09aH/RHty7XB8P/fbJ6G9ZRlZbnoZ69ubBRsdkEecxmhkeK3kt+z7QU7YIW6GvK0wIq6sR9rGmwSvMVm+YUV3lA2H1RZbfx+xVuwwl8bGEatW7Ysi9gv0RXBlCxzO8HU8BwoU+A9YTg/DGhtKwfWq1dGWGWi3mRl9oi15HavZCPYrZ3OlTdk7Rrvj158/vJm2fHZrAJTkV+e9Gt17PJR3X9sNCkxYZ8PLL8LSvW6X/dHgJCij2On+JiE6R5zTwyf2PuKA42r2l19x/MXbINm+d3/X79CuCPW8xLhihgHpm7j6uOAjaqaLPE51nsVt014L9c37+tjp9/Uf4r34YHtk4wIVe2/uzj8P+1wjRvhUGdNGpMGRZvC6ZMS7wMUtKoi20V4Y9H0cYvzAhThiaYSfOaBnmEmcmw2ZgA0+qDgfI0GT5+/lO0rQjDzmvmzMiHVovv9JqC1G7efrdIQHFNWxtMAzYOaNB6icWm8Z/POfp1jTchwUxS1PT8wdpsqGg+/36rHu8+f/34on1jP399Vcy35s8U6+6cZ1GlOWWK7fVEOd6/SoijpGDuTExpmq+Y+lhTvPm+zdCC+fz1TU3fmpeQ5g2edw7NxstfESVMjSn7PdTnN2H+GDS4gXNVxfAM0Hc60IKBY3AFA+JVWlNcvSXMPqXJxabR2tZVixRRQC6VBPuaeStOzApT9rrE7gKyxcx/nhXpZSmNmc9f/5Hif2N+Z9bPDFsxd03z4mfSKs1Xd8xv19O9FvenW+Knm7g313WRN17c/yfLu38yGPM7c0G82jDs8p8toPFRA7r9c4lh2WBLiz8ScYa4JMWROXdvZllUzFVD6ytpbptnyrxcXGbQZyJc0XSZRgHFzUYY1LjTZtiYYZlff/2V+fz13SfpN+Y35vPX13312yux/VmaDB+ZII/f5vq3kPSDsecf8vKKymXGeUvDv2/cfWx55dh3hH6E4urAZvh4geNd4Kii/8fALzi/IvkPp/nj8fXSw8+6/QFrz7q/LV+ZNH5hLH2o/2mTBMcY539+YJxzi8HxWSGjIt/h6twp0vr8PAQmc+6KFbNPcM7sMUOCbR4lzUYU0AvD714hfZuuv71G/9w/vt0xv/32uoQ/EMQvjXZb3nBlalzt0gjf8F1UuAwqzLwfof5/zVR4U1D83u1ykesiyjCtm41rOz73XpwH58mCZfNi/z3aNcRtKP/re1gf7rsc9wOYLPup8d8BAAD//6NuSRpQGAAA" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ part {
          ~ content      = <<-EOT
                #cloud-config
                
                users:
                  - name: ec2-user
                    ssh_authorized_keys:
                      - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                      - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
                
                write_files:
                  - path: /tmp/cloud_init_vars
                    content: |
                      OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                      COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                      OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                      COMPOSER_HOST=aws.composer.osbuild.org
                      COMPOSER_ADDRESS=10.30.18.11
                      WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                      SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                      SYSTEM_HOSTNAME_PREFIX=staging-internal-worker
                      COMPOSER_DIR=/etc/osbuild-composer
                      SECRETS_MANAGER_ENDPOINT_URL=https://vpce-0d13154306549b1cd-9zxr7z5v.secretsmanager.us-east-1.vpce.amazonaws.com/
                  - path: /etc/osbuild-composer/osbuild-composer.toml
                    content: |
                      [koji]
                      allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                
                      [worker]
                      allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
            EOT -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
    }

  # data.template_file.external_workers_cloud_config will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "external_workers_cloud_config"  {
      ~ id       = "752620bd680d32564065cbe582a08c5827a24614e3cf7039fc49e3cec47d5e29" -> (known after apply)
      ~ rendered = <<-EOT
            #cloud-config
            
            users:
              - name: ec2-user
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
            
            write_files:
              - path: /tmp/cloud_init_vars
                content: |
                  OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                  COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                  OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                  COMPOSER_HOST=aws.composer.osbuild.org
                  COMPOSER_ADDRESS=172.31.64.11
                  WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                  SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                  SYSTEM_HOSTNAME_PREFIX=staging-external-worker
                  COMPOSER_DIR=/etc/osbuild-composer
                  SECRETS_MANAGER_ENDPOINT_URL=https://secretsmanager.us-east-1.amazonaws.com/
              - path: /etc/osbuild-composer/osbuild-composer.toml
                content: |
                  [koji]
                  allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
            
                  [worker]
                  allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
        EOT -> (known after apply)
      ~ vars     = {
          ~ "composer_address"                = "172.31.64.11" -> (known after apply)
            # (8 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # data.template_file.internal_workers_cloud_config will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "internal_workers_cloud_config"  {
      ~ id       = "72d77bba8bef7070aada81f9dc56b40fa29d44bda1215cf79c71cf591ab2c32c" -> (known after apply)
      ~ rendered = <<-EOT
            #cloud-config
            
            users:
              - name: ec2-user
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
            
            write_files:
              - path: /tmp/cloud_init_vars
                content: |
                  OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                  COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                  OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                  COMPOSER_HOST=aws.composer.osbuild.org
                  COMPOSER_ADDRESS=10.30.18.11
                  WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                  SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                  SYSTEM_HOSTNAME_PREFIX=staging-internal-worker
                  COMPOSER_DIR=/etc/osbuild-composer
                  SECRETS_MANAGER_ENDPOINT_URL=https://vpce-0d13154306549b1cd-9zxr7z5v.secretsmanager.us-east-1.vpce.amazonaws.com/
              - path: /etc/osbuild-composer/osbuild-composer.toml
                content: |
                  [koji]
                  allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
            
                  [worker]
                  allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
        EOT -> (known after apply)
      ~ vars     = {
          ~ "composer_address"                = "10.30.18.11" -> (known after apply)
            # (8 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_instance.composer_external must be replaced
-/+ resource "aws_instance" "composer_external" {
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-0654ebbbd69258c54" -> (known after apply)
      ~ associate_public_ip_address  = true -> (known after apply)
      ~ availability_zone            = "us-east-1f" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-0654ebbbd69258c54" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-02f250427cdd85dc7" -> (known after apply)
      ~ private_dns                  = "ip-172-31-64-11.ec2.internal" -> (known after apply)
      ~ private_ip                   = "172.31.64.11" -> (known after apply)
      ~ public_dns                   = "ec2-34-234-177-181.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                    = "34.234.177.181" -> (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [
          - "external_composer_staging",
        ] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-0c016a02" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 External Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data_base64             = "H4sIAAAAAAAA/9S7aZOcSn4v/L4j5jtgzYmwHcfVzVKFVJqRw0UBtZLZJGRS4MehYOtiSRYBtcCZ892fSKql6dZ2PPfeF7YiiG6S/O+//5INWlZlF5fdxO7r+D1XnGiX1n7TPRTpNY7+wgXVqYz8pv/wxtgYmgIxUBfIfXPH7iYkbtq0Kt9zwj3/p7s/3U0mLzf96e4zbzVt66pNu3Gv33V+mBRx2f2Fe0ppXPpF/OFNWqbdffh0fPN3Krvxy/YpbiZaGVZRWh7fc2+DtHuxYVS5i6/dQ0irUzQJq/IpPf7pzkiL+Bvl/vxyz93dqY2b9v0dx004psF7Lg7FCVu84ziOa9vko3/qkqpJhzj6mMf9uJf9m3Bv2jaZNK3PLRaLhSKBwV8KfShq7FZdmAtlsVgsF+bymj3pmw1dPS3LeRrSdV84jaY0NhbpXu5ya2ULcf02Wj4OFyFzZadMTPp4MOr4sUnBFRzo6l3owPkD0msl4oe5fgH9r/nTMZk/nXrgTuebXw1fhr1NlOMsAZV+fUKH1Sxdd+GDZdIy0PR0V1v5lKZ1NTW9TumK4+LTMbcWsjok/TGQTzNjnl7tzXXqKNnJMvjVwRxAVsdPfeqcfm036NdExI2Z7xbK6bRxzaDJ6K96Qgp/f27OvQ3FUwu7c+kqWRI8Xnr4VnQeM7/eRQ/zxPY/PWrCRe9lrIvlIZw+Hi/8MTUDuU0D3R7eAju+OtLMnL/7VJvQMdxdWB+9hlr+er3zLCPpBvjWiLwG7nV8qCxhES/66THpQtBAxabBzDo/vpWGgf+kIF0Ml3AK+Us9u1w+PSbni1h2gVTb+8cuirvtr2TGm49lXR56yyq9Whz0SxiLQnC4ym/LZE7LZN94xyx+G1Zm+bjQrw8hlWTN2vbH9PQYKpdfc+Gde6KuccCffKXLL9t9jjK1zuyDGM+MrSBX6tt2uw6nD84s75/258hoSRJ9EpaH9YoQWA/VMeDnM+KmPDrodemhByEmx+UD+tUhfec+ue/45onAMFpU4sp7KrezwUX4sN3ODS/3y+tV0t5imObaFsxbnIk8P8jLvuc3T5tPdrAVlNnT26dI8kPU7Kdq6OJI3zwISg8cWReyt6GXLlZwuwPBcNB5W+qe3l35WDA/fOAKP6ua/2jiKPG7+7Aq3rzGexyJs5kwHzG/vGGeeupGALY2Y2ubR0XIdDqtZd1W0uvali8wlw/vyuzBextXj8DUHgz+spu+m+24KjhFfvpK2N2lSbv4I6sIz2lZ+13ynnvoivqW3h9Zjfh49pt21Cy8VYH33N+eFYWWgjd79eMSGsbG/vBOCv2ndzwfz8SZOA2mwvTp7dMseJr5MR9J4VwQw3dzYS4+Uy+h8QgtDX0mf/s0iyU5iubTd8KMf/LDacBLsiSHciTNg+CtHIvxOyF6+lr44uNSQ/aHvcV3e0tYIhxt7VRREdliC3tbk9cxGp/x3TIXthZGGtGAajreweN1ycJbxeMpwSowDdEdAFFWOJ8JgejxcWHMbDUX0SrBgYiUiEfIwfU+EOqtv/YyO9cRwpedSXUl4r1PiBBg5nRt2jpBWJci/poa/Kz29KgNhVoFBy8LHCBZqySzc+GTeYgeiUZkmyAvxoJGbHDwVwDah1qJLjV7Nn31LNcPNtmiiCelg5GDia4hTeejwuitTE+IlDT2ip/FpJZNHiiYpxLSdc/Ku7OT0yoqAFyOOm+XGOuaJ0Y61nRt3OvMVXZv5jowS6VxiO5aBBjukOwdpwaY0DIuFQQxUAxhuzeKaINU5eoe9CHKjjuXbDOSGyKgxszLkyvC+OrjK3G0d5KhblGckcEX68qQ6qu9pmucJRKm7nkvgq3hbK5hppCY1LbLX31DCCVC6t68VDxQUeFK1WAf6DTQgUwE4mFBKc2c7v1VpMC13oW0tgxnXrgO6uM1sexlNwS5p1lONzWksHEHfecRcjIK0Bp6VC8p4R11u0aCpyIaAVvUz16OGkcnKirJ3lpHO+xEK3uNBksDvuOAIqKRY+m1D/LpNOKji0F137E3M3dIhOCgfDLIYoc1r3U0Y+qtdN/WhMTRaYpsBVgH5Bga2FilIiGeXtySngJCcbDsBlQSMVDRmayEPl5X5/iQyKGGRJILj2GubwOzngZiK4WUdGRNcrQiOha2S1uMFAN3gosFi6xJYh0UFAzbPJC8625YXFHhDiae9gQDJeKJYjo6JJqwQodogwnVltSzDG2+NCnVUV5Jnu25hpRfvNW8Da35zqVe7ea0jkR0wsKiAbmwhFqkGITk1iFCDhaWLtZXVhZRQI9DbCt5IF52P6BVPtOiQ6Sb6VzC2AMmFpam406/n1fXLxg1j7WCyloEIqUWH84Cvd6H+aa3HcH3Nf1qadSInWtiS9QJ7VBCA13aZItRCS5OiXljvZGQgCSXR1VUHAWEwdnS9XRZXJvIVlyA567HI9FZg2W4mq+s9VY0tO7Rcq42EMjOOLgXsGrPFqWlsw6bYFVjsjbO8FBfgiyxSHHtwjU+I154tG28w852jZcd9DPihwMpEO8dfG0q2fZGwE5HoLrdBeuEWrne4kOyMcWrildkinMAXFufgcNCIqtZCVVlb9GIj4liQrPmsRgBs1xIgBDLc97xAOMp1ureKheDv6ZnoG+nkGwRErs+doBlHaLCzBPRlxJgFd4pFA3JseYicKiAsqSLNUFeZoB382q24+sZwrpgraurm0dCiIG7k/QdJghHyzkKBreP8ujg4nyGBW/vUmPqksQwhy0EpZ75zvYaZnjqZUizcnNnlaC1rXdSuAazMNPP4IB4N9+eAM0F82DMl+mtJiM80zYa0DFFW5RT1SRIv9VyfvdNp2CF3hRJH61o4TsgiVZYXqaL42apaO4BJfBYHTfLxe3SPRqWoA7EqbxRjeNOVaZGmu++PF8qtnfY1q5zOdol6dyC9K/ob5doqNUU2tXUHaqLMdQU2HUBhjoHQ8VDtc7doboaQyV4ajW4dnVxs2oGxvs69+w68ezqCrLqCu06Ba/0A7UnzpJoTXrPUpRgFZ3DgvL+ipc3a1C59kYANKqjVWJhXteDAvTxQeF9Z3662Xy7rAMYIof0MFVUOxPOobgVfOea74t5711e+SMJVjT3D2j2kn68tNk5WipLz/HOYYHljVYnQbq4GuxSqx7YVQ+Xi95QN9eNFgGy+NpPCgwk82g6Hu8dNkeYKjvXmR4Ne8Eu2ciwbGTHo5EtBsNS1jYxX8UhcrafPAfwMFVo4Oh1oOm5t97SUDLmgQTSyKGttyJ9yCu956DKPZgnV5x3L+3AEkn9gmTRUjEjZ9v6jnG0RDLbaPTkFe/kb2zWFcEtrrXbK3vvkB9N51oG0pb5u4Op0ofij33+QncL89oRr0karGi2xx2N7eq4UzcXoB6PbkH5nfkNpsbLduZ55FyFcKh233v+fF0MtS5AVueeWmcsFtCuE2CzxljNoFoJRlbxIKvYIYJCu86MrGIxG4zsZ3wVCjLGt5qN8c0q3lPrwrMrybCrwR0q0c3qFNjVwDDv2Yx/Jbh2nXn2T/WdeUyvkU+dunbVu0MlsVwxskpk9IZaXZnez7xYbl1GvX/Ot/fUSgRDJRlqnTG+HvPBUKdsDah14TK/MDuyujDUinezSjTsSvg5X6Vw7VEf0VPHPGW+6CGTkVUD088b/cP0q1Omp2uPec576k/1Zbx4w64LY2DNtS6MrM6ZnmwNqFXvZqw2sBpRzVy7pizOrJ78QdwSd2A8qgHaTOe6cIexNolAHf1L3ayaGsNoh+Tat5h62ejnn+nLj/VpYHiqqTFUV4/F54a5C9PbyyoB3vzaG/ZYEwTPri7g5/iVGDbdYbTrAlXGuy7cbMTZ9ZnHzLBZbOuE4YbhzGN4/ilfhRpqJT7nwtRT6wSoNQVDNfVuvpl5GcNfTd1h5CUaDM8Zs+vnfrjV8JoyvZkfWby9W34x/abguc4DtRJAVk2ZDSAb/f8zviNmjNEX1ZX5w8vqxBjljDHkme0uwwxbZ3vt6sJy6Q/4jv5i/oQqw+don2TccvDC4gPVasqwbIzPRjwMQK0T9+dx4z2b5WjVGxnLhREbU6iy+1HW6GvIcM1iyvzC8i6rrn8QtwKOOGW1q07dgeG+GlgNYjgecTdi45bjY84wvLG8+Hkep+CW9/2oi3qLH8iqi2HXiTHWtjpnuehmY8++sPww1D+qD4sBqmONnLI8cFm9Um8zAFRZHEccX0a82ZUAb/2f1ajE+2keL1j9S8Hl+70BHZJLIM5oUJryRnUFYBvSZnm8xKp2MdTF9VVP0Y+CoVLR6BUarxENxplnNnw7yygusBezKDOOZqEPrD+a4vwUSqh3HXqK1oa8WYHeP6DaFfX2B/1ONe16ZeKrjb7pa3/n/6IXj73VcpheqPYKSsOsOn6f90IEaq2gsR7XK2TXGrLrpWHXGsMcUmud9Q22btr1Et5605LhBzCd7EpEWa2jrFYMu1bRz+w/EN5fzZmts43W0dhStt6KnG5zJZulFt+P3aqjsUNzmFEd5kiHOZ7BLNJg7vYwN68wRwrMNgLM9eW4lpElzLAIs40Ic2MKs2QJs4UEM1eCmTmFubeC+Vb5ga81/7CFriNQmM5/Ptu9uEKR9L6jtzADK5iFA8yZrGgFs0iHGVrBTBNgpg0w83SYa1eYe8tx37jX7GHuaTDHU5gxffFw22Nelj/x5zhn6WRwnYjCVMnGOdYBSfDNnPiM7xUt/QNKgqVi+050cg9ICAvcPseCzV11uEpoWAgsB76JhaPiCzy4w0Yj02hFTt6K5M+0JBT10rN/hDEF27pxJCJJNzqgYenRMFWU6IAqz5nxtzMFPQc/sfUFtpVgjWhYzBiN6FnKc6x+gB0NQTzUWSAKl0ACNExnr+PZX45Im9mwBDzz474A5+CgnFk898V8cEtSByvzFEjbcr9UNJsasnuIhp/tez4bvfTx13Pu4K+0HtjewT+gClOgIGeWhSW9fOsHJYFjrlUzg52FsrGPZeNsc5vhWI9gffD6eY5kdZfNC6xPj3OPPc6Ur/zjioYMVxvZyzQZDAsZiFj27IXsOZrsFVgGq41s2LlsZLnsqZrs2lj2VFd2C0021KPsrbAMbfP1fL8iFGZHht8eFtsEFl4GM6WA2XEGswXLyxxm+eW2hxSw2OYwc6ewIAkscA8ztj/86jyosB40Y71jPOux+ZD1LWaTymalcZYZ+zebE8Ftdph5rF+oVe+xeTQb55tX9kPHkL3MlIFtyO5gyq59HH1hFK7sOVg2BmYnll0Ry5Dd25oMVSwbaii7Qziuednitf3qgodZksPC4GGhF7AweZhpIizMKcw2A8yUHBaYh4V7hdlmCrNQhNlxgJnGw8wVR7rMvH7VQ2Zs9vTU8dzL5odhPP/a4z2bO1lPz8DYs+vk1r8rkZ2N3ay6eOysMdQp/GqeMWwsg8yVoW3IgPlhtJHZxeJuymDYyK7IbN7IwA5loDKsHGXXdmV39Buz3/0q/noGCz2FmTsba1iWz2C2LWCBL7DQLjBzeZhtmK0DzI4CLLQeZvgKM1TAbDEdnxea8HX8gVqnxm1OvY6zMrvPWO8f/SAZt78F8MZzDrAZj/lrxIU6zpVsrnmNfzuUjWEhG8w+EcuGY8oGw/aKnZlD2c1c2Su00Q8GyxXVHPEOBoabXAYFw8jmq/gfRZhFGcz0FBaIwizkYaZTWBgDzIwLzEAKC1e89YGwh9mmhxnDzEaAmZLBjNKR9nX82TmG5XFmDOM8JIx4sMecn4Khzp/Po8J4PmU5wOwe6nSc78c1NrO/tp/luFe4MliZsqeaMlCN0TaD5UGBZTfbyEbB1rUx9qxeeOpixAewN7Jnfy//QQKzcHbD9OLy+Y9NZk7WFp4eTZ5YRKMrCwOFaHh8tjdrYGGqxU6tmrzeW2KkRDxdmk60JYRuAywoO+E4GLbyyeXx1VA9FTgoNySNJ3yUOodIw4TuLHHuW04iuvxMwZgYy3yLzEO08nNCbLzdIl67EkyUSIoMNwPQd9AhWAPfHIjoikIW8Unl8jPg50SyCdJjLGDzQCHRcp6I44sDGR3CHXsW8S+f1UqABRsfoq0nfKWH0y1RkTgvXxQ4NNnFVN9YxdVHYlJ5miH4R4ZnRfLESPexoBhapGJJX2OepgaPEMJbBROimDbamjmSzENUejzZm858a+Y6QupmcHn9EurEdghpHHsjujxFy1wQ3GzbmEIN9+JMhytNIodK8mmdxOWidwqQBhLIDa2+Rvy2cg/12edrCQ/6yeWFc0Q2kqcumpDUJtQI7+ukCIR859KtF+AOhH33CYvbZeSAM6DIcvLN1BiimUGUjaG1IhBJF2GTN9a6HGvzgzEkn5CwvYIMgcAhIrDmNXH4gRwI8Mxadnld3w96ZWvUJgVZGkI+NVbRJz9tB0Q8N9S8U0gS38unjVkqF8feNsA2eeBMpbAE0Mjb3lp1Z1sln+yDbsaFflkWiRbwxAkE7+Dk6GIKyjIuvHPkbKZYSHhTnBOEZ62l16mHr43ngJ3Pz1XrAKbW2uWN9VYHjr4NJTz4GOyAivmgDHdAp2mM3bO/1jt7XZc2BjOkHQdL67aRTktjtU0jnnpkJUCPj8q9hCAYgOKUESErijxev1o2KTwRZNgRKBF0PrrUvXHQBtOJgJnrChLr0ssSyRM9KeKRMr58yhRsEn2z57eKdYgUpOm5WUSQ5AkCGll5gk6cvOUda86D8ngJMnBe0oQPbQIAr113In+OinkG1xHBhGqEbi5+vtUDKbItrJOgNKVw5RW2vul9EvVwdeUJXw8+vi6NAm33Q3T1teiKSb6z8daLNU8zCVh6/Mwxcx3Y2OjhofYC6l3cPEKRsxmsYlb6unZ2+3m+F70G6p5uZF61GwCMM0U0xPkjyueVoSHFvtQjL0vXpmauF1AjSxMLqlnoSsQT6dkHrZnrUsSD0sF0Hwl0aVKdWJouoUPkfLYL51sdrCNsYUqWNO/hAWVooLJDky3Tyy5oTsTr4OSGEBWg8zBYB/n04pAoD7RrZ5de6mhb0R22Toyv3bd2TXeemFT+yhzsA/GMjPIuH85iWrvWgXz3JeTXLwZNouu2tkUmRiynlybuSsOsm4inWVx6ulWaPXZIRjRTskR9YxxQFuPL1NE2DdDm/U4AU19aXFySHCIn+uQ510eQUxKWmylSUWMKiW/y1AWDfl5mnmCVIIu0KEM6GiDueqLNXJ/vLvGaXj2VqNChebiuLsRO7GBI7L1EACbJY1Aka5Rvpp6DpyYBMNbaM8Ee74nVDq0IjrVu42K0QuJWx6SWIQH7aDB7X6z7AAspkfTaKupD1Hc4wlsncNoeF2QFDoC4EriagnuxVXQJ6daBB30WHuuE5HPfXnaqJ9QqLurKxbVF1lHlS0qOpfqKC4RCaSG5Dpjaub4J0o4nq06x1/TqSpESZCi3xJAPSiSGa2paBJBlYZyDNQGBUE3RkAuGlgz2IXrcCxS7It0iXKPYIWtj8KpoQEu3n3eYP/Yorx1cAAetwYHkXuJl4ZmskIVWYOqn7S4U86tJ9SGmemfgaxtowgU4kWTa/O75Jblu5+YPemD14euXLpa1/7jTXOvjAoEPflO+9y/t+zYOm7hrC7/0j3Hz/tROYr/tJsL7uSS9nYnC/O18Pn/e9T6+dnFT+vRjWBV11cbN+HnP5DjT+KP9LM7CirVEm0d7A8FHYwEWq+cvAxZA/T+X3J6CNmzSukurcvJMMgmrovDLaJKbLq3mn+W7lq0ZH9fQssHC0D4+Ik3fHD60nX9My+PkswmTzyZ87SV1gz48xF34ULXBKaXR1xstbYk02/pimgbUR7gB9keM9h+Srqvb9w8Pr227/2LbvV/4Q1X6l/Y+rIqHlx9rfE/kNwv3XVXQ73/D8Z95laX/9XzjU1pd4uhjVBV+WrbcB+4/uTdd7Bf3zxzvq+b45t+4N8kpuA+a+PL1+qVq8rj59hH3WULocx+4N9/XOvQnYdPd13Hx5u6zdjeG/7B+/8/0+PEndv/Ix3LXSZvElN6g+KOv5f7pIUjLh8Bvk7s27rhJfKq4Oq3jJz+ld211asL4+9/m3P2ZW8Ud1yUxl5Zt55dhzG3U+7sNsOwFWGofN+qHX/4lPDWUm+xbjoHt/cODIM/vxdn0/vnnA/W7uO0eirjzJ5Hf+Q+feU3S6F+ZjEXbxkVAYy6p2q70i/j+Tsf7/ZeU+fDml9++n0W/T3757YUyv98/A/mGzZfxYXIem7TsuOp0s6iMLy8ExmFScW+suOvS8si1fdvFxZfHXFdxv/z2Sqff70eW1rN7viK4v/v8W9hRro27yRdWv7xi878DBs/OuZW8gDnoCxy6ikNrcHMGio9p28XNa8Bc0i4Z99w9nNrmgVahT0dN/EvLva5L3DHuJrelydmnp5j7/1hF+ryURtwvv/1ROf+d+xuXfeImDffm3hrprK5Jy+Mb7t9v1r2s3B+fBX98rtz3WVuVd5/Jf7bzzX+TGfc3bvR4U3CTp/+uAnff6y7PX9tyk4l/6qr/TcBR45pWPYMN686cX0ZcGDdd+pSGrDTcwHPbNELnOW+55eLlvvu7wG9jecpNIm7C/fWvf+V++e2rT/V+5/6d++W3l53z9xc19yspn8vEH8l49Y3IdyU8M/ojOXnc/1/kQFxGdZWW3YRV219++1nX//07afPdoesPc+XVWPU6OV4+evOj3Tf0f3HoT3zHnMN89yJPviP8fwro7zTF+mjZEC1W2oeHKD4/lOciFkrhzrIXtnab2c5+80DT4Nu57atmc6r/jpG2qxr/GP+9uZzqz2tcVX7Zd3+XPnH/xB2buGZY+Czzd+6hbqrwoahOZdf+hcGvvOO4P3Na2Z6amNMUi0tb7ulEac8GtjIOuzjintKm7e7vOO6pajh7Y2iIS0vuN/7+XuL53//CRdU426RPXNv5HffLC+O/yGD/gib28/H3p/T26T2N45oT7jguqsr4blRlmcRhzngddGv8TwPPrTNtOZ82sR/1XOFHMVNntPH61H5My6fqR2KL/Km9vz61r57fjSqM8gw//1JRJi/87HcxF6VNHHZV0zNRRdq2aXlkgos8Shtu8tq3N3aLKGI9b5zvntrOD8ZyNjqcUd4i+8tvL3T5/XWEmKpR/OSfaNdyPMe/4f7GdXHMTfwXTJkOjOVro0YFUMzgaGn7tDxdb1P3tWuZ7CZmSInDquQm6Mx9xt+NjGHphbfruBntrcqRNEyqC6PiPn7tqfffrHzHKSRu0idW7fznaegZsWnLXZq08wMa33FcV53C5BX1w33dVOeUqZGWx48hgwYzZKwBf7jxKf0fUw/+O9PT97I9bs5p+LkDLqLs1HZ/f9pVHGXzVMky3+fKqpywkSrym4irq6a7+TttORq3LUfTPKY9Iwriuz9zbeiXZRyN6KybKoij+7s/czZU4b8Uid9Hcfmv7zmHTcFsUxgyFgxATRqyoaNlMm9TcseOPByNzzHl/I5rq4LxH3vRv3HBqeMuMUvvf+64xD/HXNpxTXpMOq6sLvd3XzJpxPYNfNHzz28K48Sv0/u2CvO4u48e7lhW/ONk1TlumjSK78OqfGJ9bKzOJ0q5v/6V06B+95/WuPW/7vajc62uif3iw+u7+bu38h3bfBPJhvjIj4uqnDQxrfzodpqIa7/5trb8M3NkUXUxdzsrfonyGIubnu39C86F3+ZfuNxo/kO4f6Z6sS8uWSJxk0lZXb7sv4l6Jnv2wh/RfMdx32TSZPKnu/8/AAD//+EA2QpQNgAA" -> "H4sIAAAAAAAA/9S7aZOcSn4v/L4j5jtgzYmwHcfVzVKFVJqRw0UBtZLZJGRS4MehYOtiSRYBtcCZ892fSKql6dZ2PPfeF7YiiG6S/O+//5INWlZlF5fdxO7r+D1XnGiX1n7TPRTpNY7+wgXVqYz8pv/wxtgYmgIxUBfIfXPH7iYkbtq0Kt9zwj3/p7s/3U0mLzf96e4zbzVt66pNu3Gv33V+mBRx2f2Fe0ppXPpF/OFNWqbdffh0fPN3Krvxy/YpbiZaGVZRWh7fc2+DtHuxYVS5i6/dQ0irUzQJq/IpPf7pzkiL+Bvl/vxyz93dqY2b9v0dx004psF7Lg7FCVu84ziOa9vko3/qkqpJhzj6mMf9uJf9m3Bv2jaZNK3PLRaLhSKBwV8KfShq7FZdmAtlsVgsF+bymj3pmw1dPS3LeRrSdV84jaY0NhbpXu5ya2ULcf02Wj4OFyFzZadMTPp4MOr4sUnBFRzo6l3owPkD0msl4oe5fgH9r/nTMZk/nXrgTuebXw1fhr1NlOMsAZV+fUKH1Sxdd+GDZdIy0PR0V1v5lKZ1NTW9TumK4+LTMbcWsjok/TGQTzNjnl7tzXXqKNnJMvjVwRxAVsdPfeqcfm036NdExI2Z7xbK6bRxzaDJ6K96Qgp/f27OvQ3FUwu7c+kqWRI8Xnr4VnQeM7/eRQ/zxPY/PWrCRe9lrIvlIZw+Hi/8MTUDuU0D3R7eAju+OtLMnL/7VJvQMdxdWB+9hlr+er3zLCPpBvjWiLwG7nV8qCxhES/66THpQtBAxabBzDo/vpWGgf+kIF0Ml3AK+Us9u1w+PSbni1h2gVTb+8cuirvtr2TGm49lXR56yyq9Whz0SxiLQnC4ym/LZE7LZN94xyx+G1Zm+bjQrw8hlWTN2vbH9PQYKpdfc+Gde6KuccCffKXLL9t9jjK1zuyDGM+MrSBX6tt2uw6nD84s75/258hoSRJ9EpaH9YoQWA/VMeDnM+KmPDrodemhByEmx+UD+tUhfec+ue/45onAMFpU4sp7KrezwUX4sN3ODS/3y+tV0t5imObaFsxbnIk8P8jLvuc3T5tPdrAVlNnT26dI8kPU7Kdq6OJI3zwISg8cWReyt6GXLlZwuwPBcNB5W+qe3l35WDA/fOAKP6ua/2jiKPG7+7Aq3rzGexyJs5kwHzG/vGGeeupGALY2Y2ubR0XIdDqtZd1W0uvali8wlw/vyuzBextXj8DUHgz+spu+m+24KjhFfvpK2N2lSbv4I6sIz2lZ+13ynnvoivqW3h9Zjfh49pt21Cy8VYH33N+eFYWWgjd79eMSGsbG/vBOCv2ndzwfz8SZOA2mwvTp7dMseJr5MR9J4VwQw3dzYS4+Uy+h8QgtDX0mf/s0iyU5iubTd8KMf/LDacBLsiSHciTNg+CtHIvxOyF6+lr44uNSQ/aHvcV3e0tYIhxt7VRREdliC3tbk9cxGp/x3TIXthZGGtGAajreweN1ycJbxeMpwSowDdEdAFFWOJ8JgejxcWHMbDUX0SrBgYiUiEfIwfU+EOqtv/YyO9cRwpedSXUl4r1PiBBg5nRt2jpBWJci/poa/Kz29KgNhVoFBy8LHCBZqySzc+GTeYgeiUZkmyAvxoJGbHDwVwDah1qJLjV7Nn31LNcPNtmiiCelg5GDia4hTeejwuitTE+IlDT2ip/FpJZNHiiYpxLSdc/Ku7OT0yoqAFyOOm+XGOuaJ0Y61nRt3OvMVXZv5jowS6VxiO5aBBjukOwdpwaY0DIuFQQxUAxhuzeKaINU5eoe9CHKjjuXbDOSGyKgxszLkyvC+OrjK3G0d5KhblGckcEX68qQ6qu9pmucJRKm7nkvgq3hbK5hppCY1LbLX31DCCVC6t68VDxQUeFK1WAf6DTQgUwE4mFBKc2c7v1VpMC13oW0tgxnXrgO6uM1sexlNwS5p1lONzWksHEHfecRcjIK0Bp6VC8p4R11u0aCpyIaAVvUz16OGkcnKirJ3lpHO+xEK3uNBksDvuOAIqKRY+m1D/LpNOKji0F137E3M3dIhOCgfDLIYoc1r3U0Y+qtdN/WhMTRaYpsBVgH5Bga2FilIiGeXtySngJCcbDsBlQSMVDRmayEPl5X5/iQyKGGRJILj2GubwOzngZiK4WUdGRNcrQiOha2S1uMFAN3gosFi6xJYh0UFAzbPJC8625YXFHhDiae9gQDJeKJYjo6JJqwQodogwnVltSzDG2+NCnVUV5Jnu25hpRfvNW8Da35zqVe7ea0jkR0wsKiAbmwhFqkGITk1iFCDhaWLtZXVhZRQI9DbCt5IF52P6BVPtOiQ6Sb6VzC2AMmFpam406/n1fXLxg1j7WCyloEIqUWH84Cvd6H+aa3HcH3Nf1qadSInWtiS9QJ7VBCA13aZItRCS5OiXljvZGQgCSXR1VUHAWEwdnS9XRZXJvIVlyA567HI9FZg2W4mq+s9VY0tO7Rcq42EMjOOLgXsGrPFqWlsw6bYFVjsjbO8FBfgiyxSHHtwjU+I154tG28w852jZcd9DPihwMpEO8dfG0q2fZGwE5HoLrdBeuEWrne4kOyMcWrildkinMAXFufgcNCIqtZCVVlb9GIj4liQrPmsRgBs1xIgBDLc97xAOMp1ureKheDv6ZnoG+nkGwRErs+doBlHaLCzBPRlxJgFd4pFA3JseYicKiAsqSLNUFeZoB382q24+sZwrpgraurm0dCiIG7k/QdJghHyzkKBreP8ujg4nyGBW/vUmPqksQwhy0EpZ75zvYaZnjqZUizcnNnlaC1rXdSuAazMNPP4IB4N9+eAM0F82DMl+mtJiM80zYa0DFFW5RT1SRIv9VyfvdNp2CF3hRJH61o4TsgiVZYXqaL42apaO4BJfBYHTfLxe3SPRqWoA7EqbxRjeNOVaZGmu++PF8qtnfY1q5zOdol6dyC9K/ob5doqNUU2tXUHaqLMdQU2HUBhjoHQ8VDtc7doboaQyV4ajW4dnVxs2oGxvs69+w68ezqCrLqCu06Ba/0A7UnzpJoTXrPUpRgFZ3DgvL+ipc3a1C59kYANKqjVWJhXteDAvTxQeF9Z3662Xy7rAMYIof0MFVUOxPOobgVfOea74t5711e+SMJVjT3D2j2kn68tNk5WipLz/HOYYHljVYnQbq4GuxSqx7YVQ+Xi95QN9eNFgGy+NpPCgwk82g6Hu8dNkeYKjvXmR4Ne8Eu2ciwbGTHo5EtBsNS1jYxX8UhcrafPAfwMFVo4Oh1oOm5t97SUDLmgQTSyKGttyJ9yCu956DKPZgnV5x3L+3AEkn9gmTRUjEjZ9v6jnG0RDLbaPTkFe/kb2zWFcEtrrXbK3vvkB9N51oG0pb5u4Op0ofij33+QncL89oRr0karGi2xx2N7eq4UzcXoB6PbkH5nfkNpsbLduZ55FyFcKh233v+fF0MtS5AVueeWmcsFtCuE2CzxljNoFoJRlbxIKvYIYJCu86MrGIxG4zsZ3wVCjLGt5qN8c0q3lPrwrMrybCrwR0q0c3qFNjVwDDv2Yx/Jbh2nXn2T/WdeUyvkU+dunbVu0MlsVwxskpk9IZaXZnez7xYbl1GvX/Ot/fUSgRDJRlqnTG+HvPBUKdsDah14TK/MDuyujDUinezSjTsSvg5X6Vw7VEf0VPHPGW+6CGTkVUD088b/cP0q1Omp2uPec576k/1Zbx4w64LY2DNtS6MrM6ZnmwNqFXvZqw2sBpRzVy7pizOrJ78QdwSd2A8qgHaTOe6cIexNolAHf1L3ayaGsNoh+Tat5h62ejnn+nLj/VpYHiqqTFUV4/F54a5C9PbyyoB3vzaG/ZYEwTPri7g5/iVGDbdYbTrAlXGuy7cbMTZ9ZnHzLBZbOuE4YbhzGN4/ilfhRpqJT7nwtRT6wSoNQVDNfVuvpl5GcNfTd1h5CUaDM8Zs+vnfrjV8JoyvZkfWby9W34x/abguc4DtRJAVk2ZDSAb/f8zviNmjNEX1ZX5w8vqxBjljDHkme0uwwxbZ3vt6sJy6Q/4jv5i/oQqw+don2TccvDC4gPVasqwbIzPRjwMQK0T9+dx4z2b5WjVGxnLhREbU6iy+1HW6GvIcM1iyvzC8i6rrn8QtwKOOGW1q07dgeG+GlgNYjgecTdi45bjY84wvLG8+Hkep+CW9/2oi3qLH8iqi2HXiTHWtjpnuehmY8++sPww1D+qD4sBqmONnLI8cFm9Um8zAFRZHEccX0a82ZUAb/2f1ajE+2keL1j9S8Hl+70BHZJLIM5oUJryRnUFYBvSZnm8xKp2MdTF9VVP0Y+CoVLR6BUarxENxplnNnw7yygusBezKDOOZqEPrD+a4vwUSqh3HXqK1oa8WYHeP6DaFfX2B/1ONe16ZeKrjb7pa3/n/6IXj73VcpheqPYKSsOsOn6f90IEaq2gsR7XK2TXGrLrpWHXGsMcUmud9Q22btr1Et5605LhBzCd7EpEWa2jrFYMu1bRz+w/EN5fzZmts43W0dhStt6KnG5zJZulFt+P3aqjsUNzmFEd5kiHOZ7BLNJg7vYwN68wRwrMNgLM9eW4lpElzLAIs40Ic2MKs2QJs4UEM1eCmTmFubeC+Vb5ga81/7CFriNQmM5/Ptu9uEKR9L6jtzADK5iFA8yZrGgFs0iHGVrBTBNgpg0w83SYa1eYe8tx37jX7GHuaTDHU5gxffFw22Nelj/x5zhn6WRwnYjCVMnGOdYBSfDNnPiM7xUt/QNKgqVi+050cg9ICAvcPseCzV11uEpoWAgsB76JhaPiCzy4w0Yj02hFTt6K5M+0JBT10rN/hDEF27pxJCJJNzqgYenRMFWU6IAqz5nxtzMFPQc/sfUFtpVgjWhYzBiN6FnKc6x+gB0NQTzUWSAKl0ACNExnr+PZX45Im9mwBDzz474A5+CgnFk898V8cEtSByvzFEjbcr9UNJsasnuIhp/tez4bvfTx13Pu4K+0HtjewT+gClOgIGeWhSW9fOsHJYFjrlUzg52FsrGPZeNsc5vhWI9gffD6eY5kdZfNC6xPj3OPPc6Ur/zjioYMVxvZyzQZDAsZiFj27IXsOZrsFVgGq41s2LlsZLnsqZrs2lj2VFd2C0021KPsrbAMbfP1fL8iFGZHht8eFtsEFl4GM6WA2XEGswXLyxxm+eW2hxSw2OYwc6ewIAkscA8ztj/86jyosB40Y71jPOux+ZD1LWaTymalcZYZ+zebE8Ftdph5rF+oVe+xeTQb55tX9kPHkL3MlIFtyO5gyq59HH1hFK7sOVg2BmYnll0Ry5Dd25oMVSwbaii7Qziuednitf3qgodZksPC4GGhF7AweZhpIizMKcw2A8yUHBaYh4V7hdlmCrNQhNlxgJnGw8wVR7rMvH7VQ2Zs9vTU8dzL5odhPP/a4z2bO1lPz8DYs+vk1r8rkZ2N3ay6eOysMdQp/GqeMWwsg8yVoW3IgPlhtJHZxeJuymDYyK7IbN7IwA5loDKsHGXXdmV39Buz3/0q/noGCz2FmTsba1iWz2C2LWCBL7DQLjBzeZhtmK0DzI4CLLQeZvgKM1TAbDEdnxea8HX8gVqnxm1OvY6zMrvPWO8f/SAZt78F8MZzDrAZj/lrxIU6zpVsrnmNfzuUjWEhG8w+EcuGY8oGw/aKnZlD2c1c2Su00Q8GyxXVHPEOBoabXAYFw8jmq/gfRZhFGcz0FBaIwizkYaZTWBgDzIwLzEAKC1e89YGwh9mmhxnDzEaAmZLBjNKR9nX82TmG5XFmDOM8JIx4sMecn4Khzp/Po8J4PmU5wOwe6nSc78c1NrO/tp/luFe4MliZsqeaMlCN0TaD5UGBZTfbyEbB1rUx9qxeeOpixAewN7Jnfy//QQKzcHbD9OLy+Y9NZk7WFp4eTZ5YRKMrCwOFaHh8tjdrYGGqxU6tmrzeW2KkRDxdmk60JYRuAywoO+E4GLbyyeXx1VA9FTgoNySNJ3yUOodIw4TuLHHuW04iuvxMwZgYy3yLzEO08nNCbLzdIl67EkyUSIoMNwPQd9AhWAPfHIjoikIW8Unl8jPg50SyCdJjLGDzQCHRcp6I44sDGR3CHXsW8S+f1UqABRsfoq0nfKWH0y1RkTgvXxQ4NNnFVN9YxdVHYlJ5miH4R4ZnRfLESPexoBhapGJJX2OepgaPEMJbBROimDbamjmSzENUejzZm858a+Y6QupmcHn9EurEdghpHHsjujxFy1wQ3GzbmEIN9+JMhytNIodK8mmdxOWidwqQBhLIDa2+Rvy2cg/12edrCQ/6yeWFc0Q2kqcumpDUJtQI7+ukCIR859KtF+AOhH33CYvbZeSAM6DIcvLN1BiimUGUjaG1IhBJF2GTN9a6HGvzgzEkn5CwvYIMgcAhIrDmNXH4gRwI8Mxadnld3w96ZWvUJgVZGkI+NVbRJz9tB0Q8N9S8U0gS38unjVkqF8feNsA2eeBMpbAE0Mjb3lp1Z1sln+yDbsaFflkWiRbwxAkE7+Dk6GIKyjIuvHPkbKZYSHhTnBOEZ62l16mHr43ngJ3Pz1XrAKbW2uWN9VYHjr4NJTz4GOyAivmgDHdAp2mM3bO/1jt7XZc2BjOkHQdL67aRTktjtU0jnnpkJUCPj8q9hCAYgOKUESErijxev1o2KTwRZNgRKBF0PrrUvXHQBtOJgJnrChLr0ssSyRM9KeKRMr58yhRsEn2z57eKdYgUpOm5WUSQ5AkCGll5gk6cvOUda86D8ngJMnBe0oQPbQIAr113In+OinkG1xHBhGqEbi5+vtUDKbItrJOgNKVw5RW2vul9EvVwdeUJXw8+vi6NAm33Q3T1teiKSb6z8daLNU8zCVh6/Mwxcx3Y2OjhofYC6l3cPEKRsxmsYlb6unZ2+3m+F70G6p5uZF61GwCMM0U0xPkjyueVoSHFvtQjL0vXpmauF1AjSxMLqlnoSsQT6dkHrZnrUsSD0sF0Hwl0aVKdWJouoUPkfLYL51sdrCNsYUqWNO/hAWVooLJDky3Tyy5oTsTr4OSGEBWg8zBYB/n04pAoD7RrZ5de6mhb0R22Toyv3bd2TXeemFT+yhzsA/GMjPIuH85iWrvWgXz3JeTXLwZNouu2tkUmRiynlybuSsOsm4inWVx6ulWaPXZIRjRTskR9YxxQFuPL1NE2DdDm/U4AU19aXFySHCIn+uQ510eQUxKWmylSUWMKiW/y1AWDfl5mnmCVIIu0KEM6GiDueqLNXJ/vLvGaXj2VqNChebiuLsRO7GBI7L1EACbJY1Aka5Rvpp6DpyYBMNbaM8Ee74nVDq0IjrVu42K0QuJWx6SWIQH7aDB7X6z7AAspkfTaKupD1Hc4wlsncNoeF2QFDoC4EriagnuxVXQJ6daBB30WHuuE5HPfXnaqJ9QqLurKxbVF1lHlS0qOpfqKC4RCaSG5Dpjaub4J0o4nq06x1/TqSpESZCi3xJAPSiSGa2paBJBlYZyDNQGBUE3RkAuGlgz2IXrcCxS7It0iXKPYIWtj8KpoQEu3n3eYP/Yorx1cAAetwYHkXuJl4ZmskIVWYOqn7S4U86tJ9SGmemfgaxtowgU4kWTa/O75Jblu5+YPemD14euXLpa1/7jTXOvjAoEPflO+9y/t+zYOm7hrC7/0j3Hz/tROYr/tJsL7uSS9nYnC/O18Pn/e9T6+dnFT+vRjWBV11cbN+HnP5DjT+KP9LM7CirVEm0d7A8FHYwEWq+cvAxZA/T+X3J6CNmzSukurcvJMMgmrovDLaJKbLq3mn+W7lq0ZH9fQssHC0D4+Ik3fHD60nX9My+PkswmTzyZ87SV1gz48xF34ULXBKaXR1xstbYk02/pimgbUR7gB9keM9h+Srqvb9w8Pr227/2LbvV/4Q1X6l/Y+rIqHz7L3EKvOwl6uP+7hyvo+S1od258x+vLVx/d0/2bhvqsK+v2PQf4zr7L0v55vfEqrSxx9jKrCT8uW+8D9J/emi/3i/pnjfdUc3/wb9yY5BfdBE1++Xr9UTR433z7iPksIfe4D9+b7Wof+JGy6+zou3tx91u7G8B/W7/+ZHj/+Vu8f+eruOmmTmNIbpn/02d0/PQRp+RD4bXLXxh03iU8VV6d1/OSn9K6tTk0Yf/8jn7s/c6u447ok5tKy7fwyjLmNen+3AZa9AEvt40b98Mu/hKeGcpN9yzGIvX94EOT5vTib3j//fKB+F7fdQxF3/iTyO//hM69JGv0rk7Fo27gIaMwlVduVfhHf3+l4v/+Sex/e/PLb99Px98kvv71Q5vf7ZyDfsPkyPkzOY5OWHVedbhaV8eWFwDhMKu6NFXddWh65tm+7uPjymOsq7pffXun0+/3I0np2z1cE93effws7yrVxN/nC6pdXbP53wODZObfaGTAHfYFDV3FoDW7OQPExbbu4eQ2YS9ol4567h1PbPNAq9OmoiX9pudcFjjvG3eS2NDn79BRz/x+rSJ+X0oj75bc/6gu/c3/jsk/cpOHe3FsjndU1aXl8w/37zbqXLeDjs+CPzy3gPmur8u4z+c92vvlvMuP+xo0ebwpu8vTfVeDue23q+bNdbjLxT131vwk4alzTqmewYW2e88uIC+OmS5/SkJWGG3hum0boPOctt1y83Hd/F/htLE+5ScRNuL/+9a/cL7999c3f79y/c7/89rIF//6i5n4l5XOZ+CMZrz42+a6EZ0Z/JCeP+/+LHIjLqK7SspuwavvLbz8bH37/Ttp8d3r7w1x5NZ+9To6Xj978aPcN/V8c+hPfMecw373Ik+8I/58C+jtNsT5aNkSLlfbhIYrPD+W5iIVSuLPsha3dhr+z3zzQNPh2APyq2Zzqv2Ok7arGP8Z/by6n+vMaV5Vf9t3fpU/cP3HHJq4ZFj7L/J17qJsqfCiqU9m1f2HwK+847s+cVranJuY0xeLSlns6Udqzga2Mwy6OuKe0abv7O457qhrO3hga4tKS+42/v5d4/ve/cFE1zjbpE9d2fsf98sL4LzLYv6CJ/Xz8/Sm9fcNP47jmhDuOi6oyvhtVWSZxmDNeB90a//fBc+tMW86nTexHPVf4UczUGW28PrUf0/Kp+pHYIn9q769P7avnd6MKozzDz79UlMkLP/tdzEVpE4dd1fRMVJG2bVoemeAij9KGm7z27Y3dIopYzxvnu6e284OxnI0OZ5S3yP7y2wtdfn8dIaZqFD/5J9q1HM/xb7i/cV0ccxP/BVOmA2P52qhRARQzOFraPi1P19vUfe1aJruJGVLisCq5CTpzn/F3I2NYeuHtOm5Ge6tyJA2T6sKouI9fe+r9NyvfcQqJm/SJVTv/eRp6Rmzacpcm7fyAxncc11WnMHlF/XBfN9U5ZWqk5fFjyKDBDBlrwB9ufEr/x9SD/8709L1sj5tzGn7ugIsoO7Xd3592FUfZPFWyzPe5sionbKSK/Cbi6qrpbv5OW47GbcvRNI9pz4iC+O7PXBv6ZRlHIzrrpgri6P7uz5wNVfgvReL3UVz+63vOYVMw2xSGjAUDUJOGbOhomczblNyxIw9H43NMOb/j2qpg/Mde9G9ccOq4S8zS+587LvHPMZd2XJMek44rq8v93ZdMGrF9A1/0/PObwjjx6/S+rcI87u6jhzuWFf84WXWOmyaN4vuwKp9YHxur84lS7q9/5TSo3/2nNW79r7v96Fyra2K/+PD6bv7urXzHNt9EsiE+8uOiKidNTCs/up0m4tpvvq0t/8wcWVRdzN3Oil+iPMbipmd7/4Jz4bf5Fy43mv8Q7p+pXuyLS5ZI3GRSVpcv+2+insmevfBHNN9x3DeZNJn86e7/DwAA//+tOTU1mTYAAA==" # forces replacement
      ~ vpc_security_group_ids       = [
          - "sg-0be4cfbfac3cc0022",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 External Composer (staging)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0daeecfc25da04a05" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-068014a3af88f57d3" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_instance.composer_internal must be replaced
-/+ resource "aws_instance" "composer_internal" {
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-02cfe356a7283027d" -> (known after apply)
      ~ associate_public_ip_address  = false -> (known after apply)
      ~ availability_zone            = "us-east-1a" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-02cfe356a7283027d" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-07088640399f60f49" -> (known after apply)
      ~ private_dns                  = "ip-10-30-18-11.ec2.internal" -> (known after apply)
      ~ private_ip                   = "10.30.18.11" -> (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-04a176042c3118735" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 Internal Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data_base64             = "H4sIAAAAAAAA/9S7eZOcSH43/n9H7HvA2omwHePq5qhCKu3K4aKAOslsjkwK/HMogKSLIzkE1AGz895/kVRL261rvM/z/GErgtCQmd/78z1SxSyrsovLbuL0dfyeK060S+ug6R6K9BqTv3BhdSpJ0PQf3hgbQ1MgAurC8t7csbcJjps2rcr3nHDP/+nuT3eTyctDf7r7zFtN27pq0248G3RdECVFXHZ/4Z5SGpdBEX94k5Zpdx89Hd/8ncppgrJ9ipuJVkYVScvje+5tmHYvDowqd/G1e4hodSKTqCqf0uOf7oy0iL9R7s8vz9zdndq4ad/fcdyEYxq85+JInLDFO47juLZNPganLqmadIjJxzzux7Psz4R707bJpGkDbrFYLBQJDMFS6CNRY6/qwlwoi8ViuTCX1+xJ32zo6mlZztOIrvvCbTSlcZBI93KX2ytHiOu3ZPk4XITMk90yMenjwajjxyYFV3Cgq3eRC+cPll4rhB/m+gX0v+ZPx2T+dOqBN51vfjUCGfYOVo6zBFT69ck6rGbpuosebJOWoaanu9rOpzStq6npd0pXHBefjrm9kNUh6Y+hfJoZ8/TqbK5TV8lOtsGvDuYAsjp+6lP39Gu7sX5NRNSY+W6hnE4bzwybjP6qJ7gI9ufm3DtQPLWwO5eekiXh46WHb0X3MQvqHXmYJ07w6VETLnovI10sD9H08Xjhj6kZym0a6s7wFjjx1ZVm5vzdp9qEruHtovroN9QO1uudbxtJN8C3BvEbuNfRobKFRbzop8eki0ADFYeGM/v8+FYaBv6TYulitIRTyF/q2eXy6TE5X8SyC6Xa2T92JO62v+IZbz6WdXnobbv0a3HQL1EsCuHhKr8tkzktk33jH7P4bVSZ5eNCvz5EVJI1e9sf09NjpFx+zYV33ol6xgF9CpQuv2z3uZWpdeYcxHhmbAW5Ut+223U0fXBnef+0PxOjxQn5JCwP6xXGsB6qY8jPZ9hLeeug16VvPQgxPi4frF9d3Hfek/eOb54wjMiiElf+U7mdDZ6FDtvt3PDzoLxeJe0tgmmubcG8RZnI84O87Ht+87T55IRbQZk9vX0iUhBZzX6qRh4i+uZBUHrgyrqQvY38dLGC2x0Ih4POO1L39O7Kx4L54QNXBFnV/EcTkyTo7qOqePMa7zERZzNhPmJ+ecM89dWNABxtxtY2j4qQ6XRay7qjpNe1I19gLh/eldmD/zauHoGpPRj8ZTd9N9txVXgiQfpK2N2lSbv4I6sIz2lZB13ynnvoivqW3h9Zjfh4Dpp21Cy6VYH33N+eFYW2gjZ79eMSGsbG+fBOioKndzwfz8SZOA2nwvTp7dMsfJoFMU+kaC6I0bu5MBefqZfQeIS2Zn0mf/s0iyWZkPn0nTDjn4JoGvKSLMmRTKR5GL6VYzF+J5Cnr4UvPi41y/mwt/lubwtLC5GtkyqqhbfIRv7W5HVkjXt8t8yFrY0sDWtANV3/4PO6ZKOt4vMUIxWYhugNACsrlM+EUPT5uDBmjpqL1ipBoWgphLcsF9X7UKi3wdrPnFy3LHTZmVRXCO9/sjAGZk7XpqNjC+kS4a+pwc9qXydtJNQqOPhZ6ALJXiWZkwufzAN5xBqWHWz5MRI07IBDsALQOdQKudRsb/pqL9cPDt5ahMeliywXYV2zNJ0nhdHbmZ5gKWmcFT+LcS2bPFAQTyVL1307785uTitSALgcdd4uEdI1XyQ60nRtPOvOVfZu5jowS6Vxse7ZGBjekOxdtwYI0zIuFQsioBjCdm8UZGOpytU76APJjjsPbzOcGyKgxszPk6uF0DVAV+xq7yRD3VpxhodArCtDqq/Omq5RlkiIeue9CLaGu7lGmYJjXDsefw0MIZIwrnvzUvFAtQpPqgbnQKehDmQsYB8JSmnmdB+siALXehfR2jbceeG5Vh+vse0suyHMfc12u6khRY036Dsf45NRgNbQSb2kmHfV7doSfNWiBDiifvZzq3F1rFol3ttrskMuWTlra7A1ELguKAglrq3XAcinU8KTi0H1wHU2M29IhPCgfDLwYoc0v3U1Y+qv9MDRhMTVaWo5CrAPlmtoYGOXimTx9OKV9BRiisJlN1glFkPVOuOV0Mfr6hwfEjnSLBHnwmOU69vQrKeh2EoRxR1e49xaYR0J26UjEsVAneAhwcZrnNgHxQqHbR5K/nU3LK5W4Q0mmvYYAYXwWDFdHWJNWFkHskGYakvq24Y2X5qU6lZeSb7je4aUX/zVvI3s+c6jfu3ltCaidULCogG5sIQaUQyMc/tALBcJSw/pKzsjFNDjEDtKHoqX3Q9olc+01oHoZjqXEPKBiYSl6XrT7+fV9QtGzWOtWGUtApFSm49moV7vo3zTO64QBJp+tTVqxO41cSTqRk4kWQNdOniLrBJc3BLxxnojWYIlebxVkeIoWAicbV1Pl8W1IY7iATT3fN4S3TVYRqv5yl5vRUPrHm336gAB74yDdwGr9mxTWrrrqAlXNcJr4wwP9SXMEhsX1y5ao7PFC4+Og3bI3a7RsoNBhoNowIXF+4dAm0qOsxGQ22GobnfhOqF2rrfokGxM8aqiFZ6iHADP0WfgsJDwalZCVdnblPAxVkxo1jwSCTDLhQQwtn33HQ8QmiKt7u1yMQRregb6dgrx1rLEro9dYNsHUph5IgZSAuzCP0WiIbn2XAQuFaws6WJNkJcZ4L28mu34emYhXbDX1dXLiRAh4O0kfYewhchyboWD15OcHDyUz5Dg7z1qTD2cGOawhaDUs8DdXqMMTf3M0uzc3NklaB37nRStwSzK9DM4WLyXb0+A5oJ5MObL9FaTLTTTNhrQEbW2Vk5VE1v6rZbzu286BSv0poh7sqJF4IKErJC8TBfHzVLRvIOVwGN13CwXt0f3aVSCOhSn8kY1jjtVmRppvvuyv1Qc/7CtPfdydErceQXuX9HfHtFQqyl0qqk3VBdjqClw6gIMdQ6GiodqnXtDdTWGSvDVavCc6uJl1QyM73XuO3XiO9UVZNUVOnUKXukHal+cJWSNe99WlHBFzlFB+WDFy5s1qDxnIwBKarJKbMTreliAPj4ofODOTzebb499AANxcQ9TRXUy4RyJWyFwr/m+mPf+5ZU/knBF8+BgzV7Sj482O5OlsvRd/xwVSN5odRKmi6vBHrXqgVP1cLnoDXVz3WgE4MXXflJgKJlH0/V5/7A5wlTZee70aDgL9shGhmQjOx6NbDEYtrJ2sPkqDsTdfvJdwMNUoaGr16Gm5/56SyPJmIcSSIlLW3+F+4hXet+1Ku9gnjxx3r20A0k4DQqckaViEnfbBq5xtEU822j05Bfv5G9s1hXBK6611yt7/5AfTfdahtKW+buDqdJH4o99/kJ3G/HaEa1xGq5otkcdjZ3quFM3F6Aej15B+Z35DabGx3HnOXGvQjRUu+/tPz8XQ60LkNW5r9YZiwV06gQ4rDFWM6hWgpFVPMgqdomg0KkzI6tYzAYj+xlfhYKM8a1mY3yzivfVuvCdSjKcavCGSvSyOgVONTDM+w7jXwmeU2e+81N9Zz7Ta+RTp55T9d5QSSxXjKwSGb2hVlem9zMvlluXUe+f8+19tRLBUEmGWmeMr898MNQpWwNqXXjML8yOrC4MteK9rBINpxJ+zlcpPGfUR/TVMU+ZL3rIZGTVwPTzR/8w/eqU6ek5Y57zvvpTfRkv3nDqwhhYc60LI6tzpidbA2rVexmrDaxGVDPPqSmLM6snfxC3xBsYj2qADtO5LrxhrE0iUEf/Ui+rpsYw2iF5zi2mfjb6+Wf68mN9GhieamoM1dVn8blh7sL09rNKgDe/9oYz1gTBd6oL+Dl+JYZNbxjtukCV8a4LLxtxdn3mMTMcFts6YbhhOPMZnn/KV6GGWonPuTD11ToBak3BUE39m29mfsbwV1NvGHmJBsNzxuz6uR9uNbymTG/mRxZv/5ZfTL8peK7zQK0EkFVTZgPIRv//jO+IGWP0RXVl/vCzOjFGOWMMeWa7xzDD1tlZp7qwXPoDvqO/mD+hyvA52icZtxy8sPhAtZoyLBvj3oiHAah14v08brzvsByteiNjuTBiYwpV9j7KGn0NGa5ZTJlfWN5l1fUP4lbAEaesdtWpNzDcVwOrQQzHI+5GbNxyfMwZhjeWFz/P4xTc8r4fdVFv8QNZdTGcOjHG2lbnLBe9bOzZF5YfhvpH9WExQHWskVOWBx6rV+ptBoAqi+OI48uIN6cS4K3/sxqV+D/N4wWrfym4fL83WIfkEoozGpamvFE9ATiGtFkeL7GqXQx1cX3VU/SjYKhUNHqFxmuLhuPMMxu+nWUUDziLGcmMo1noA+uPpjg/RZLVey49kbUhb1agDw5W7Yl6+4N+p5pOvTLR1bG+6Wt/5/+iF4+91XaZXlbtF5RGWXX8Pu+FCNRascZ6XK8sp9Ysp14aTq0xzFlqrbO+wdZNp17CW29aMvwAppNTiVZW61ZWK4ZTq9bP7D9gPljNma2zjdbR2Fa2/gqfbnMlm6UW34/dqqOxS3OYUR3mlg5zNIMZ0WDu9TA3rzC3FJhtBJjry3Etw0uYIRFmGxHmxhRmyRJmCwlmngQzcwpzfwXzrfIDX2vBYQs9V6Awnf98tnvxRCLuA1dvYQZWMIsGmDNZZAUzosPMWsFME2CmDTDzdZhrV5j7y/HceNbsYe5rMEdTmDF90XA7Y16WP/HnOGfpePBcQmGqZOMc64Ik/GZOfMb3ipbBwUrCpeIELjl5B0uICtQ+x4LNXXW0SmhUCCwHvomFq6ILPHjDRsNTssInf4XzZ1ociXrpOz/CmIIc3ThiEacbHdCo9GmUKgo5WJXvzvjbnYKew5/Y+gLbSri2aFTMGI3o28pzrH6AHc2CaKizUBQuoQRolM5ex7O/HC1t5sAS8MyP+wKcw4NyZvHcF/PBK3EdrsxTKG3L/VLRHGrI3oEMPzv3fDd66eOv59whWGk9cPxDcLAqRIFiubMsKunlWz8oCRxzrZoZ7C6UjX0sG2eb2wzHegTrg9fPcySru2xeYH16nHuccaZ85R9PNGS42sh+pslgWMhARLLvLGTf1WS/QDJYbWTDyWUjy2Vf1WTPQbKverJXaLKhHmV/hWTomK/n+xWmMDsy/Paw2Caw8DOYKQXMjjOYLVhe5jDLL7czuIDFNoeZN4UFTmCBepix89FX90GF9aAZ6x3jXY/Nh6xvMZtUNiuNs8zYv9mcCG6zw8xn/UKtep/No9k437yyH7qG7GemDBxD9gZT9pzj6Auj8GTfRbIxMDuR7IlIhuzd0WSoItlQI9kbonHNzxav7VcXPMySHBYGDwu9gIXJw0wTYWFOYbYZYKbksEA8LLwrzDZTmEUizI4DzDQeZp440mXm9aseMmOzp6+O9142Pwzj/dcZ39ncyXp6BsaeXSe3/l2J7G7sZdXFZ3eNoU7hV/OM4SAZZJ4MHUMGzA+jjcwuFndTBsNG9kRm80YGTiQDlWHlKHuOJ3uj35j93lfx1zNY6CnMvNlYw7J8BrNtAQt0gYV2gZnHw2zDbB1gdhRgofUwQ1eYWQXMFtNxv9CEr+MP1Do1bnPqdZyV2XvGev/oB8m4/VsAbzznAJvxmL9GXKjjXMnmmtf4dyLZGBaywewTkWy4pmwwbK/YnTmSvcyT/UIb/WCwXFHNEe9gYLjJZVAwjGy+iv9RhBnJYKansLAozCIeZjqFhTHAzLjADKSw8MRbH4h6mG16mDHMbASYKRnMKB1pX8ef3WNYHmfGMM5DwogHZ8z5KRjq/Pk+Koz3U5YDzO6hTsf5flxjM/tr+1mO+4Ung5Up+6opA9UYbTNYHhRI9rKNbBRsXRtjz+qFry5GfABnI/vO9/IfJDCLZjdMLy6f/7HJzPHaRtOjyWMba3RlI6BgDY17e7MGNqJa7Naqyeu9LRKF8HRpumSLMd2GSFB2wnEwHOWTx6OrofoqcK3ckDQe8yR1D0RDmO5scR7YbiJ6/ExBCBvLfGuZB7IKcowdtN1avHbFCCtEIoaXARi41iFcg8AcsOiJQkb4pPL4GQhyLDnY0mMkIPNAIdZyHovjDweydYh2bI/wL/dqJUSCgw5k6wtf6eF2S6tI3Jc/FLg02cVU39jFNbDEpPI1QwiODM+K5ItED5CgGBpRkaSvEU9Tg7csC20VhLFiOtbWzC3JPJDS5/HedOdbM9ctS90MHq9fIh07LsaN62xEj6fWMhcEL9s2plDDvTjT4UqT8KGSAloncbno3QKkoQRyQ6uvhN9W3qE+B3wtoUE/ebxwJngj+eqiiXBtQg3zgY6LUMh3Ht36IepA1HefkLhdEhecAbVsN99MjYHMDKxsDK0VgYg7gkzeWOtyrM0PxpB8soTtFWQWCF0sAnteY5cf8AED36xlj9f1/aBXjkYdXOClIeRTY0U+BWk7WNj3Is0/RTgJ/HzamKVycZ1tAxyTB+5UikoAjbzt7VV3dlT8yTnoZlzol2WRaCGP3VDwD25uXUxBWcaFfybuZoqEhDfFObbQrLX1OvXRtfFdsAv4uWofwNRee7yx3urA1beRhIYAgR1QER+W0Q7oNI2Rdw7Weues69JBYGZpx8HWui3RaWmstinhqY9XAvR5Uu4lC4IBKG5JMF5Ry+f1q+3gwhdBhlyBYkHnyaXujYM2mC4BZq4rlliXfpZIvuhLhLeU8cenTEEm1jd7fqvYB6JYmp6bBYE4Tyyg4ZUv6NjNW9615zwoj5cwA+clTfjIwQDw2nUn8mdSzDO4JhhhqmG6uQT5Vg8l4thIx2FpStHKLxx90weY9HB15TFfDwG6Lo3C2u4Hcg00ckU43zlo68ear5kYLH1+5pq5Dhxk9PBQ+yH1L15OLOJuBruYlYGunb1+nu9Fv4G6rxuZX+0GAONMEQ1x/mjl88rQLMW51CMvW9emZq4XUMNLEwmqWegK4bH07IPWzHWJ8KB0Ed0TgS5NqmNb0yXrQNzPdqF8q4M1QTaieEnzHh6szBqo7NJky/RyCppj8Tq4uSGQAnQ+Auswn15cTPJQu3ZO6aeuthW9YevG6Np9a9d054tJFazMwTlg38go7/HRLKa1Zx/wd3+E/PqHQRPruqNtLRNZLKeXJupKw6wbwtMsLn3dLs0euTjDminZor4xDlYWo8vU1TYN0Ob9TgDTQFpcPJwciEs++e71EeQUR+VmaqlWYwpJYPLUA4N+Xma+YJcgIxrJLN0aIOp6rM28gO8u8ZpefRWr0KV5tK4u2EmccEicvYQBwsljWCRrK99MfRdNTQxgrLVnjHzeF6udtcIo1rqNh6yVJW51hGsZYrAng9kHYt2HSEixpNd2UR9I3yGCtm7otj0q8AocAPYkcDUF7+Ko1iWiWxce9Fl0rBOczwNn2am+UKuoqCsP1TZekyqQlBxJ9RUVlhVJC8lzwdTJ9U2YdjxedYqzpldPIkqYWbktRnxYWmK0pqaNAV4WxjlcYxAK1dQacsHQksE5kMe9QJEn0q2Fait28doY/IoM1tLr5x3ij72V1y4qgGutwQHnfuJn0RmvLNtagWmQtrtIzK8m1YeY6p2Brm2oCRfgEsl0+N3zj+S6k5s/6IHVh69/dLHt/ced5tkfFxb4EDTl++DSvm/jqIm7tgjK4Bg370/tJA7abiK8n0vS25kozN/O5/PnU+/TsoubMqAfo6qoqzZuxs97Jm11bqb5szgbKfbS2jw6Gwg+GguwWD1/GbAA6v+55PYUtlGT1l1alZNnkklUFUVQkkluerSaf5bv2Y5mfFxD2wELQ/v4aGn65vCh7YJjWh4nn02YfDbhay+pG+vDQ9xFD1UbnlJKvj5oa0tLc+wvpmlAfYQb4HxE1v5D0nV1+/7h4VxH8YQngiTMphIvz6bzUIjIZD5cm7fD7Hz/2vb7L7bfM8L7oAiGqgwu7X1UFQ8vv+j4nl7fLNx3VUG//6HHf+ZVlv7X80tAaXWJyUdSFUFattwH7j+5N10cFPfPHO+r5vjm37g3ySm8D5v48vX6pWryuPl2i/ssIQq4D9yb72sdBZOo6e7ruHhz91m7G8N/WL//Z3r8+Du8f+SLuuukTWJKb3j90Sd1//QQpuVDGLTJXRt33CQ+VVyd1vFTkNK7tjo1Ufz9D3ju/syt4o7rkphLy7YLyijmNur93QbYzgIstY8b9cMv/xKdGspN9i3HEPn+4UGQ5/fibHr//PcDDbq47R6KuAsmJOiCh8+8Jin5VyZj0bZxEdKYS6q2K4Mivr/T0X7/Ja8+vPnlt++n2u+TX357oczv989AvmHzZXyYnMcmLTuuOt0sKuPLC4FxlFTcGzvuurQ8cm3fdnHxZZvrKu6X317p9Pv9yNJ+ds9XBPd3n/8r6ijXxt3kC6tfXrH53wGDZ+fc6mLIHPQFDl3FWWtwc4YVH9O2i5vXgLmkXTKeuXs4tc0DraKAjpoEl5Z7XZy4Y9xNbkuTc0BPMff/sYr0eSkl3C+//VHN/537G5d94iYN9+beHunsrknL4xvu32/WvSzvH58Ff3wu7/dZW5V3n8l/dvLNf5MZ9zdu9HhTcJOn/64Cd99rQc+f5HKTSXDqqv9NwFHjmlY9gw1r4VxQEi6Kmy59SiNWGm7guR0aofOct9xy8fLc/V0YtLE85SaEm3B//etfuV9+++p7vt+5f+d++e1le/39Rc39SsrnMvFHMl59SPJdCc+M/khOHvf/FzkQl6Su0rKbsGr7y28/Gw1+/07afHcy+8NceTV7vU6Ol1tvfnT6hv4vDv2J75hzmO9e5Ml3hP9PAf2dptgfbQdai5X24YHE54fyXMRCKdzZzsLRboPdOWgeaBp+O9x91WxO9d8x0nZVExzjvzeXU/15javKL+fu79In7p+4YxPXDAufZf7OPdRNFT0U1ans2r8w+JV3HPdnTivbUxNzmmJzacs9nSjt2cBWxlEXE+4pbdru/o7jnqqGczaGZnFpyf3G399LPP/7XzhSjbNN+sS1XdBxv7ww/osM9ids4uA2mj+lt+/zaRzXnHDHcaQq47tRlWUSRznjddDt8f8seG6dacsFtIkD0nNFQGKmzmjj9an9mJZP1Y/EFvlTe399al/t340qjPKMIP9SUSYv/Bx0MUfSJo66qumZqCJt27Q8MsFFTtKGm7z27Y3dghDW88b57qntgnAsZ6PDGeUtsr/89kKX319HiKlK4qfgRLuW4zn+Dfc3rotjbhK8YMp0YCxfGzUqYMUMjra2T8vT9TZ1X7uWyW5ihpQ4qkpuYp25z/i7kTEsvfB2HTejvVU5kkZJdWFU3MevPfX+m5XvOAXHTfrEql3wPA09IzZtuUuTdkFI4zuO66pTlLyifrivm+qcMjXS8vgxYtBghow14A8PPqX/Y+rBf2d6+l62x805jT53wAXJTm33992u4iibp0qW+QFXVuWEjVQkaAhXV01383facjRuW46meUx7RhTGd3/m2igoy5iM6KybKozJ/d2fOQeq8F+KJOhJXP7re85lUzA7FEWMBQNQk0Zs6GiZzNuU3LErD0fjc0y5oOPaqmD8x170b1x46rhLzNL7nzsuCc4xl3Zckx6Tjiury/3dl0wasX0DH3n++5vCOAnq9L6tojzu7snDHcuKf5ysOsdNk5L4PqrKJ9bHxup8opT76185Dep3/2mPR//rbj861+6aOCg+vH6bv3sr37HDN5FsiCdBXFTlpIlpFZDbbSKug+bb2vLPzJFF1cXc7a74JcpjLG56tvcvOBdBm3/hcqP5D+H+merFubhkicRNJmV1+XL+JuqZ7NkLf0TzHcd9k0mTyZ/u/v8AAAD//7c3nUB1NgAA" -> "H4sIAAAAAAAA/9S7aXOcSp4v/L4i+jswakfMTJwpiaUKu9ztiSkKqJVMsWRS0E+Hgk3FkiwGaoHT/u5PJCX5SF7kmXvvi2lHEDJJ5n/9/TeBFmXRRkU7troq+sjkR9ImlVe3d3lyicK/MH55LEKv7j7daGtNkSAC8txwbkb0boyjuknK4iPD3bJ/Gv1pNB6/3PSn0TNtOWmqsknaYa/Xtl4Q51HR/oV5TEhUeHn06SYpkvY2eDzc/HHKqr2ieYzqsVIEZZgUh4/Mez9pX2wYRG6jS3sXkPIYjoOyeEwOfxppSR59J9yfX+4ZjY5NVDcfRwwzZqgEH5ko4Md0ccQwDNM08YN3bOOyTvoofMiibthL/42Zm6aJx3XjMfP5fC4JoPcWXBfwCr2V5/pcms/ni7m+uKSP6npNlo+LYpYEZNXldq1ItYV4shPbzFxaXFS9Dxf3/ZlLHdEuYp3c77Uquq8TcAF7svwQ2HB2Z6iVFLL9TD2D7rfs8RDPHo8dcCaz9W+aJ8LOwtJhGoNSvTwa++U0WbXBnamTwlfUZFuZ2YQkVTnR3VZq88P88yEz56Lcx93BF49TbZZcrPVlYkvp0dTY5V7vQVpFj11iH39r1sZvMY9qPdvOpeNx7eh+nZLf1Bjn3u5UnzoL8scGtqfCkdLYvz938D1v36detQ3vZrHlfb5XuLPaiUjli30wuT+c2UOi+2KT+KrVvwdWdLGFqT778LnSoa0526A6uDUxvdVq65pa3PbwvRa6NdypaF+a3Dyad5ND3AaghpJF/Kl5un8v9D37WTJUPljACWTP1fR8/nwfn8580fpCZe3u2zBqN7/hKavfF1Wx70yzcCu+V89BxHP+/iK+L+IZKeJd7R7S6H1Q6sX9XL3cBUQQFXPTHZLjfSCdf8u4D86RONoeffakNjtvdpmRylVq7floqm04sZTfN5tVMLmzp1n3uDuFWoPj8DO32K+WGMOqLw8+O5tiJ2GNvVoVrnHHRfiwuDN+s3HXOo/OB7Z+xDAI5yW/dB+LzbR3DLTfbGaam3nF5SIo7xFMMmUDZg1KeZbtxUXXsevH9WfL33DS9PH9Yyh4gVHvJnLgoFBd33FSB2xR5dL3gZvMl3CzBX6/V1lLaB8/XNiI0z99YnIvLev/qqMw9trboMxvXuM9CvnplJsNmF9cMU9cec0BS5nStfW9xKUqmVSiaknJZWWJZ5iJ+w9Feue+j8p7oCt3GnveTj5Mt0zpH0MvecVsdK6TNnqgGeEpLCuvjT8yd21eXcP7geaIh5NXN4NkwTULfGT+8SQoNCW03skPC6hpa+vTByHwHj+wbDTlp/zEn3CTx/ePU/9x6kVsKAQzjg8+zLgZ/3R6AbV7aCrG8/H3j9NIEMNwNvnATdlHL5j4rCAKYiCGwsz334sRH33gwsdvmc8fFophfdqZbLszuYWBwo2VSLKBN8hE7kZnVWQMz9h2kXEbExkKVoCs2+7eZVXBRBvJZQlGMtA13ukBlpYom3I+77JRrk0tOeONZYx83pBC1jBsVO18rtp4Kze1MtUw0HmrE1UKWfezgTHQM7LSLRUbSBVC9pJo7LRy1bAJuEoGezf1bSCYyzi1Mu6zvg/vsYJFCxtuhDgFW2DvLQG09pUUniv6bPLqWabuLbwxQhYXNjJshFXFUFQ2zLXOTNUYC3FtLdlphCtRZ4GEWCIYquqaWXuyM1KGOYCLQebNAiFVcflQRYqqDHvtmUzv9UwFeiHVNlYdEwPN6eOdbVcAYVJEhWRABCSN2+y0PFwbsnRx9mofpoetgzcpzjQeEG3qZvHFQOjioQu2lQ+CJm+MKMW9x1elJlQXa0VWKI0FRJzTjgcbzV5fglTCEa4sh714GhcIGFedfi5ZIBu5I5S9tScTXwUi5rCLOKnQM7LzlqEEV2obkMrU7Fnu2EYXrbBpLdrez1zFtNuJJgS106tbF+OjloNGU8NqQTBry5uVwbmyQUJg8erJzYzaVrFsFHhnrsItssOltTJ6UwGebYM8JKFtqpUHsskkZMOzRlTPttZTp485fy991vB8ixS3sRVt4i5Vz1K42FZJYlgSMPeGrSlgbRaSYLDk7BTk6GOC/EXbGwXmfdk44SXXRavyFO1jMVAMHmfcfZCpG1+vJj7fCAHBLV7hzFhiFXGbhcWHkoZazkGciVc4NveS4febzBfcy7afX4zc6XU06TACUshiSbdViBVuaezDNcJEWRDX1JTZQidENbJScC3X0YTs7C5nTWDOtg5xKycjVcgbR8TNa5BxC6iEkoZxZu5Dw0bcwkHq0kxDAsihjywp8/nz9idnpeezxj5U9WQmIOQCHXEL3XYmP46ry1eM6odKMoqKBzwhJhtMfbXaBdm6s2zO8xT1YipEi+xLbAnEDqxAMHqysPAGGQU42wVitdVaMDhDcFijDPMDZyBwMlU1WeSXOrQkB6CZ47IGb6/AIljOluZqw2tKe2/aFwtweKvtnTNYNieTkMJeBbW/rBBeaSe4r85+Gps4v7TBCp0Mlru3LLRF9maFFi30UuwFPc4N1t17ykSwrDWH7BZDebP1VzExM7VB+3it8xcZLfEEZQA4ljoF+7mAl9MCytLOJCEbYUmHesUiPgR6MRcAxqZrf2ABQhOkVJ1ZzHtvRU5A3Uwg3hgG33aRDUxzH+Z6FvOeEAMzd48Brwm2OeOBTTgjjdtI4cRFClgnK6dbtpoaSOXMVXlxspALEHC2grpF2EDhYmb4vdOFWbh3UDZFnLtziDZxcKzp/QaCQk09e3MJUjRxU0MxM31rFqCxzA9CsALTIFVPYG+wTrY5ApJx+l6bLZJrTjbQVFkrQEXE2BgZkXVsqNdczm6/qxQ00es87sIlyT0bxOESiYtkflgvJMXZGzE8lIf1Yn69VJcEBah8fiKuZe2wlaWJlmTbr88XkuXuN5Vjnw9WgVsnx92r89eL1+RyAq1y4vTlWesrAqwqB32Vgb5koVxlTl9etL7kXLnsHas8O2k5BcN9lblWFbtWeQFpeYFWlYBX8oHK5adxuMKda0qSvwxPQU5Yb8mK6xUoHWvNARJW4TI2Eauqfg66aC+xnj07XnW+XuYe9KGNO5hIspVyp4DfcJ59yXb5rHPPr+wR+0uSeXtj+vL8cCnTU7iQFq7tnoIciWuliv1kftHoJZcdsMoOLuadJq8vayUEeP6tnSToC/pBt13W3a8PMJG2jj05aNacXqKWIlFLDwctnfeaKa0srL/yQ2hvPrs2YGEiEd9WK19RM3e1IYGgzXwBJKFNGneJu4CVOtc2SmevHx1+1r7UAwk48XKchgtJD+1N49naweTxdK2Qo5t/EL/TWZU4J79UTift3H120O1L4Qsbau8WJlIX8D+3+QvZTcQqB7TCib8k6Q61JLLKw1Zen4F8ODg5Ybf6d5gaLsueZaF94YK+3P7o+dN11uQqB2mVuXKVUl9Aq4qBRQtjOYVyyWlpyYK0pEMEgVaVamlJfdZr6Vt0JQJSSrecDv5NS9aVq9y1SkGzyt7pS95JqwRYZU8x71qUfsk5VpW61pvyTl0q10CnShyr7Jy+FGisaGnJ0/OaXF6o3E+0aGydB7nfptu5csmDvhQ0uUopXZfaoK8SugbkKneoXageaZVrcsk6aclrVsm9TVfKHWuQh3flIU6pLTpIeaRlT+VzB/tQ+aqEyulYQ5yzrvymvJQWq1lVrvW0uFa5llYZlZOuAbnsnJTmBpojyqljVYT6meaTX/gtdnpKo+yhRWWucqcfchMP5MG+xEnLidYPegiOdfWpmw52fktedshPPcVTRbS+vLjUP1fMnancblpy8GrXTrOGnMC5VnkGb+NXoNh0+kGvM5Qp7Sp30gFnlycaU82ivq1iihuKM5fi+U26EtHkkn+KhYkrVzGQKwL6cuJebTN1U4q/ijj9QIvXKJ5Tqtfbdrjm8IpQuakdqb/da3xR+SbgKc8DueRAWk6oDiAd7P8W3QEz2mCL8kLt4aZVrA18Bh+yVHeHYoau071Weaax9Au6g72oPaFM8TnoJ2jXGDxT/0C5nFAsa8OzAQ89kKvYedtvrGvRGC07LaWxMGBjAmV6P/AabA0prqlPqV1o3KXl5Rd+y+GAU5q7qsTpKe7LnuYgiuMBdwM2rjE+xAzFG42Lt+M4Ade47wZZ5Kv/QFqeNauKtSG3VRmNRScdavaZxocm/yo/zHsoDzlyQuPAoflKvvYAUKZ+HHB8HvBmlRy81n+ao2L3zTie0/yXgPOPa4Oxj88+PyV+oYtr2eGApQnrxeEcycpZk+eXVzVFPXCaTHitk0i0Mog/9DzT/vteRnKANZ+GqXbQc7Wn9VHnZ8dAMDrHJsdwpYnrJei8vVE5vNr8pN7JulUtdXSxjO/q2h/0X9TiobaaNpXLqNyckCAtDz+mPeeBXEnGkI+rpWFVimFVC82qFIo5Q65UWjfoum5VC3itTQuKH0BlskreSCvVSCtJsyrZeEv/PWa95YzqOl0rLYlMaeMu8fHaV9Jeav5j3y1bEtkkgylRYWaoMENTmIYKzJwOZvoFZoYE0zUHM3UxrKV4AVPEw3TNw0ybwDRewHQuwNQRYKpPYOYuYbaRfmJrxdtvoGNzBCazt3u7F1fA486z1QamYAnToIcZ5RUuYRqqMDWWMFU4mCo9TF0VZsoFZu5i2Dfs1TuYuQrM0ASmVF7UX/fo58Ub9hz6LBX3jh0SmEjp0MfaIPa/6xOf8L0khbc3Yn8hWZ4dHp29wQU5ap58QfuuKljGJMg5GgPf+cKW0RnunX6t4Em4xEd3ibOnszjg1cK1foYxCVmqdsA8TtYqIEHhkiCRpHBvlK49Za8zBTn5b+j6AtuSvzJIkE/pGd41pSdf/QQ7igFRX6U+z519AZAgmb72Z3c+GMrUggVgqR13OTj5e+lE/bnLZ71T4Mpf6kdf2BS7haRYRBOdfdi/te9pNnpp42/73N5bKh2w3L23N0pEgGTY0zQoyPl7O0gxHGKtnGp0FkqHOpYOvc21h6M1gtbBy3MfSfMu7RdonR76HmvoKV/Zx+E1ES7XopsqIujnIuCR6Fpz0bUV0c2RCJZrUbMyUUsz0ZUV0bGQ6MqO6OSKqMkH0V0iEVr66/5+iQlMDxS/Hcw3MczdFKZSDtPDFKZzGpcZTLPzdQ/OYb7JYOpMYI5jmKMOpnR/8M08KNEaNKW1Y5j1aH9I6xbVSaa90tDLDPWb9ong2jtMXVov5LJzaT+aDv3NK/2hrYluqovA0kSn10XHOgy20HJHdG0kaj3VE4kOj0RI7y1FhDISNTkQnT4Y1tx0/lp/ec7CNM5grrEwV3OY6yxMFR7m+gSm6x6mUgZzxMLcucB0PYFpwMP00MNUYWHq8MO5VL98U0OmtPd05WHupf1DP8y/1nBP+05a01Mw1OwqvtbvkqezsZOWZ5fOGn2VwG/6Gc1CIkgdEVqaCKgdBh2pXtTvugj6tejwVOe1CKxABDLFykF0LEd0BrtR/Z1v/K+mMFcTmDrTIYel2RSmmxzm6Axz5QxTh4Xpmuraw/TAwVzpYIouMDVymM4nw/Nc4b71P5CrRLv2qZehV6b3Ka39gx0E7fq7AFZ7igHa41F7DbiQh76S9jWv8W8FotbPRY3qxyNRs3VRo9he0pk5EJ3UEd1cGeyg0ViR9QHvoKe4yUSQU4ysv/H/gYdpmMJUTWBuEJgGLExVAnOth6l2hilIYO7w1zoQdDBddzClmFlzMJVSmBIynH3tfzrH0DhOtX7oh7gBD9YQ8xPQV9nTPMoN8ymNAap3XyVDfz+s0Z79tf40xt3cEcFSF11ZF4GsDbppNA5yJDrpWtRyuq4Mvqf5wpXnAz6AtRZd60fxD2KYBtMrpufn51826RlemWhy0FlsYoUsTQQkrKDh2U6vgImIEtmVrLNqZ/KhFLJkodvhBmOy8REnbblDr1nSZ4dFF012ZWAbmSYoLGbDxN6HCsJka/Izz7Rj3mGnEkJYW2QbQ9+HSy/D2EKbjcEqF4ywFAqh5qQAerax91fA03vMOzyXhmxcOuwUeBkWLGyoEeKQvicQKxmL+eHFgWjsgy19FrIvn1WSjzgL7cONy30jh90ujDy2X74osEm8jYi6NvOLZ/Bx6Soa5x0oniXB5UPVQ5ykKaGMBHWFWJJorGEYaCMhjCXdMjZ6Zgj6PixcFu90e7bRM9Uw5HXvsOo5ULFlY1zb1pp3WGIsMo5z0k2tcxXc8VMVLhUB70vBI1UcFfPOzkHiCyDTlOoSspvS2Vcnj60E1KtHh+VOIV4LrjyvA1zpUMGsp+Lc57KtQzauj1oQdO1nxG8WoQ1OgBimna0nWh9ONSytNaXhAY/bEOmstlLFSJnttT7+bHCbC0gN4NuYB+aswjbb4z0Grl6JDququ14tLYVYOMcLjcsm2jL87CVNb2DXCRT3GODYc7NJrRfS2bY2NbB0FtgTISgA1LKmM5ftyZLxZ2uv6lGunhd5rPgstn3O3duZcdY5aRHl7im01xPExazOz7CBpo2pVomLLrVrg63HzmRzDybmymG11UYFtroJBNR7CGyBjFi/CLZAJUmEnJO3UltrVRUWAlNDOfSm0m5ClRTacpOELHHxkoMuGxY7wYCgB5JdhBgvieGy6sW0cO7yIEU2RzCnsuG56rS90ut2CPRMlQy+Ktw0FlzeFULWkIaXT6mEdKyud+xGMvehZChqpuchxFlsAAUvXU7FdtawtjljQXE4+yk4LUjMBhYGgFUuW549hfkshasQI0wUTNZnL9uovhBaJlKxX+hCsHRzS113Hg47uLywmK16D10WWm5sdn148ZTwgnC2tdDGjRRX0TFYuOzU1jMVWEjr4L5yfeKenSw0Qnvdm/m08FTl5HSzbMe7NVRdVUvdctsDGKUSr/GzeyOblZpiSNa5GmiZqjLRMzWHCl7oiJP1XJVCFgtPNmj0TBVCFhQ2IruQIwudqNhUVMHYh/azXijbqGAVIhMRvCBZB/dGavREtEm8oXJZOckwf+ntTOPCHLQuAis/m5xtHGa+cmmtwk1sZcM7/caO0KX9Xq/J1uXj0lvqvbXHrpYS1mGDaUQqx9zjH76E/PbFoI5V1VI2ho4MGtMLHbWFpld1yJI0KlzVLPQO2TjFii6YvLrW9kYaofPEVtY1UGbdlgMTT5ifHRzvQzv87NqXe5ARHBTriSEbtc7Fns4SB/TqaZG6nFmANFTC1FCNHqK2w8rU8dj2HK3IxZWxDG2SBavyjK3Y8vvY2gkYIBzf+3m8MrL1xLXRRMcARkpzwshlXb7cGkuMIqVdO8hYGvxGRbgSIQa7sNc7j686H3EJFtTKzKt92LUoRBvbt5sO5XgJ9gA7ArjonHO2ZOMckI0N9+o0OFQxzmaetWhll6tklFelgyoTr8LSE6QMCdUF5YYRCHPBscHEytS1n7QsXraStSIXRwglPzUykw9YvzD4YEV0EwO8yLWTv8LA58qJ0WecpsS9tQ/vdxxBDk82BqqMyMYrrXfLsDcWTjdrEXvojKyyUQ5sYwX2OHNjNw1OeGmYxhJMvKTZBnx20YnaR0RtNXRpfIU7AzsUdIvdPr0kV61M/0kNLD99+9LFNHcPW8UxH+YG+OTVxUfv3HxsoqCO2ib3Cu8Q1R+PzTjymnbMfZwJwvspz83ez2azp10fk6KN6sIjD0GZV2UT1cPnPeOmPNWT7ImdiSRzYazvrTUED9oczJdPXwbMgfx/zrk5+k1QJ1WblMX46cg4KPPcK8JxpjuknD3zd0xL0R5W0LTAXFMe7g1FXe8/Na13SIrD+FmF8bMK31pJXhuf7qI2uCsb/5iQ8NuNprIwFMv8qpoC5Hu4BtYDMnaf4ratmo93d6cqiMZsyAncdCKw4nQy87kgHM/6S/2+n55uX+t++1X3W3rw1su9viy8c3MblPnds4A7iGR7bi1WDzu4NN/iy0WswPnelBUEz2eD6Tj6fDqUlxN/S8pD80tuX78f+ZEVvlu4bcuc/Pizkr9lZZr8/enGI6Q8R+FDWOZeUjTMJ+ZvzE0befntE8Xbsj7c/AdzEx/9W7+Ozt+un8s6i+rvHzHPHAKP+cTc/FjqwBsHdXtbRfnN6Fm6K8H/sXz/z+T4+Vd//5Pv9y7jJo4IuUbHzz7g+5c7PynufK+JR03UMuPoWDJVUkWPXkJGTXmsg+jHnwuN/swso5Zp44hJiqb1iiBi1vLtaA1Maw4WysNa/vTu34JjTZjxrmEoDj/e3XHi7JafTm6fft4Rr42a9i6PWm8ceq1390xrnIT/TnnMmybKfRIxcdm0hZdHtyMV7XZfo/jTzbvffxzYX8bvfn8hzJfbJyBfsfnSP5TPfZ0ULVMerxoV0fkFwyiIS+bGjNo2KQ5M0zVtlH99zLQl8+73VzJ9uR1Imk/m+ebA7ej5f0FLmCZqx19JvXtF5p8DBk/GuWZhnxroKxzakjFW4GoMIzokTRvVrwFzTtp42DO6Ozb1HSkDjwySeOeGeZ0KmUPUjq9L45NHjhHz/9GM9LyUhMy7339VYb4w/2DSz8y4Zm5uzeGc2dZJcbhh/vOq3cti8vDE+OGpmNymTVmMno+/tfPmv0mM+QczWLzOmfHjf1eA0Y8K3tMHwMx47B3b8p8JOHJUkbKjsKENA+MVIRNEdZs8JgFNDVfwXDcN0HmKW2Yxf7nvduR7TSROmHHIjJm//vWvzLvfv/l68Avzn8y7318W8y8vcu43XJ7TxK94vPps5Yccngj9ik8Wdf8XMRAVYVUmRTum2fbd7281Il9+EDY/7AN/GSuvOr3XwfHy0c3Pdl/R/9Wgb9iOGofa7kWc/ID5/xbQjxTJfDAtaMyXyqe7MDrdFac84gpuZFpzS7m2kSevviOJ/30r+U2xOVZ/YKRpy9o7RH8Ul2P1vMaUxdd9t6PkkfkX5lBHFcXCM88vzF1Vl8FdXh6LtvkLhV8xYpg/M0rRHOuIUSSTSRrm8UhIRxu2IgraKGQek7ppb0cM81jWjLXWFINJCuZ39vZWYNkvf2HCcuhtkkemab2WefdC+a886D+/jrzrIPCYXP8agERRxXAjhgnLIhoNoiziKMgorb1qDn/H8FQ6k4bxSB15YcfkXhhRcQYdL4/NQ1I8lj9jm2ePze3lsXn1fDSIMPDTvOxrRhm/sLPXRkyY1FHQlnVHWeVJ0yTFgTLOszCpmfFr217JzcOQ1ryhv3tsWs8f0tlgcHry6tl3v7+Q5ctrD1FRw+jRO5K2YViGvWH+wbRRxIy9F0SpDJTka6UGAYyIwtFUdklxvFy77kvbUN51RJESBWXBjI0T84y/6zGKpRfWrqJ60LcshqNBXJ7pKebhW0t9/G7lB0bBUZ080mznPXVDT4hNGuZcJ63nk2jEMG15DOJXp+9uq7o8JVSMpDg8BBQaVJEhB/xy42PyvyYf/He6pz+inZQHOo3SIKeeH9x+GoD49GOYqmgOHjLLkRDmr39lFKiO/nZl1Nym5ZHOseHfR21XRXTieF65GUWXgBzD6OFYJO0wydw8UW2i+pQE0c3fR6O/NUmRNbflsf2DgnduHgbhz14bxA90WrwZJUV1bJ/moa8smL+PnssRPfju97fG0y83o0NdHquHof39xNx8/3uEp/H8ZtS0deTlb+3sGlIebkbRk1dvgzKMgkH/pixuRtRIoyvGaecdFRR7zHhclGfmaoV/Usz8kbmuTnzqmuZhemzaP562JUNoD17QauExRVmMaRseenXIVGXdXmM0aRgSNQ1DkiwiHT3kR6M/M03gFUUUDhmtqks/Cm9Hf2YsKMN/y2OvC6Pi3z8yNp2c6KYgoCRo0qmTgDaqDeV5naxaOiYzJDpFhPFapilzSn8AzH8w/rFlzhEtCf/aMrF3ipikZerkELdMUZ5vR1+z7xAYV2eGTz+/K6Zjr0pumzLIovY2vPsjnv5Hx8pTVNdJGN0GZfH4w7gzh61/H+0G45oDTD+9vpt9eC8O+PsDfqEX5WUxriNSeuF1Ao0qr/6+Hv0rNWRethFz/f3CVy8PvrjK2dy+oJx7TfaVyvXMf3HPAf6zAHjef2X1dOzJCr868wPDfRdJ4/GfRv9/AAAA//9uRFjzFzkAAA==" # forces replacement
      ~ vpc_security_group_ids       = [
          - "sg-084607083aaa39727",
          - "sg-0eb65fd8f2c17dba5",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 Internal Composer (staging)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-058d1cec56397f102" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0cd95cc588c01111a" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_lambda_event_source_mapping.pozorbot_sqs will be created
  + resource "aws_lambda_event_source_mapping" "pozorbot_sqs" {
      + enabled                       = true
      + event_source_arn              = "arn:aws:sqs:us-east-1:933752197999:image-builder-pozorbot-staging.fifo"
      + function_arn                  = (known after apply)
      + function_name                 = "arn:aws:lambda:us-east-1:933752197999:function:pozorbot_staging"
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)
    }

  # aws_launch_template.worker_external_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_external_x86" {
      ~ default_version         = 1 -> (known after apply)
        id                      = "lt-0195b4ef20679c780"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "imagebuilder_worker_external_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 External Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9R4WXOrSJr2vSLqP/C5TsTXHWeQWLRY7nJFCwm0koiETJaeCQdLSiBSgCG1njr/fUKLT/ssNd090zflG5vMd8uHJ5/3xcMiZyRnvH0qyRO33VGWlkHFWtv0SOK/cGGxy+OgOj0/6FNdVQwERgPoPTQuTzwmVZ0W+RMnNoWfGj81eP690U+Nt9ijtC6LOmVX24CxIEq2JGd/4VYpJXmwJc8PaZ6yZrRaP/zdy66CvF6RilfzqIjTfP3E9cKUvTO4lszIkbUiWuxiPiryVbr+qaGnW/JdcT+/t2k0djWp6qcGx/HcpYInjkQSf1lscBzH1XXyEuxYUlTpmcQvGTldbS8/PPdQ1wlf1QE3GAwGigzOwVA8RZJ6eRwNzIEyGAyGA3N43Ky06ZSOV8O8n0Z0cto6lapUNpLoossya2yLpOzFw+X5IG68rpMnJl26ekmWVQqOwKXjx8gx+i2olUosnPvaAZw+Zqt10l/tTsBr96cf9aBrnGysrDsJKLTjCrrjTjphUcsyaR6qWjovraxN07Jomz5T2HY9eF1n1qA7OienddjddfR+erSnx7ajbHaWLoxd8ww2JVmdUmf3sZ7Cj4mEKjObD5TdbuqZYbWhH7UEb4PFvtqfbEPa1Qbb556yScLl4WT0JGe5Ccp53OondvC6VMWDduoiTcrdqL1cH4R1aobdOg01+9wDNjk6csfsP76WpuHo3jwq135FrWAymfuWnrCz0dNjvzIWGnILSxyQwam9TlgEKkOxadix9suefD4LrwrUpGhotA3hUHYOh9dlsj9IOQvl0l4sWUzY7CPuCOYyL3P3ZFm5X0pn7RARSQzdY7eXJ32aJ4vKX29ILyrMfDnQjq2Iyl3Vmp3W6W4ZKYePmfjo7ainu+g1UFh2mC0yuBmVG9uVSEefid1i1Ktnk6jdcjrZabXYx3qNk/hVHLqTMcZGeS7WodDvYC8VoKuVuQ9bIsHrYQt+dPCJeSvvUahW2IjiQSGN/VU+65w9iNzZrK/7WZAfj7LaQ0aaqTPQr9FGEoRzd3g6CdPV9NUOZ6LSWfVWsRxEsFq0R5GHYm3aEpUTcLqauOlFfjoYG7M5CM+uJtgyWz0eBSKaz8/cNtgU1V8rEicBa0bF9uFrvpNY6nTE/pXzwxvnqT+aisBWO5e16VIRNxptl13NVtLjxO4ejKzrPuablt8jxRKYaksXDvP2Y2fOFeEuDtKvkjUOVcrIy0UR7teyDFjyxLXYtrxd75eLRrzsg6q+VhbdVOCJ++1eqGEpaLoYvQwNXZ/az49yFKweBYF0pI7UDttie9VbdcJVJyBCLEd9UYoe+2JfunsPDX1pWCp8c++tOkTuxnG//Sh2hFUQtUNB7srdqBvL/TDsdYlEHsV49W3ywctQhfbzwhLYwhKHEMUzO1VGEM+QhfyZKWgIXvcENszEmYWgilUwMh3f9QVNttBM8QWK0QiYuuSdAVbGKOuIoeQLZKt37FEmwXGCQgkqsQChg8pFKJazYOJv7EyDEB3mJtWUWPBfIcbAzOjEtDUMkSbHwjHVhU7pa3EdieUIuP4mdIBsjZONnYmvphsvsYq7NoY+QaKKbeAGY2DYbqnEh/Ky1/5qL9NcG89gLODcQdBBWFOhqgnxVj9ZGy3BclLZY6FDcNk1BaAggcpQ03wrY3sno0W8BcbwWvNsiJCm+lKsIVVTr7ZOf3R5NjMNmLlSOVjzLAx075wsHKcECNOc5Ao0EFB0cbbQt/EUjpSj52rneLOee3i2wZkuAap3/Cw5QoSOATpiR32U9dEMkg0+B1JZ6HJ5tCd0gjaJjKi3X0hgpjvTY7RRMMGl7QnHQBcjGePyZB4KAYzg1pOLs+3SdqiBLhaxj0QlNzO6CMaxYkw0FtHS0p3+1nPgiUywZQ/ZOcx81XJYW5ejyjtrcx/jnb4Fta7F5ZBiwRnNJlD0R5DGwJa0vZ/BytHwCOZ4YU3iOXLisT2BZ0sFgeOAbUxjx9LKAGTtdizEB51qgWNPO945EUNXedXxYI5Uv3ZUve2PtcBWxcTRaAptBVgudHQVTK1ckaFAD15OdyGmKByyM8yxFI7gHo/FE5kUe+Im3UiFEs7EZZRps9As26FUyxHFDE9wBsdYQ+JsaEuxoiMmeki08AQnlqvA8DzLQtk/zs+DI9x6ZxO1TxgBJRawYjqagVVxDN14ijBVh9S3dLU/NCnVYFbIvu17upwd/HG/jqz+3KN+6WW0jCW4Q+KgApk4NNRY0THOLDeGDhKHHtLG1iamgK7PxFayUDrMf8dXefOFbqyZaV9GyAcmEoem47V/fK+OXzhqrksF5qUEJEotIeqEWrmIsunJdsQgULWjpVKdOMfElqkT2ZEMz3Ro4xmCOTg4ORL0yVSGIpQ9ARbxdi1CBPaWpqXD7bGKbcUDqO/5ApScCRhG4/7YmswkXWVLyznaQMRz3fUOYFzvLUpzZxJV4bhEeKLvDbc8hJvEwtsjiyZoDwVxadtojpzZBA2ZEWxwEJ3xFgq+G6ht2banInIYNkazeThJqJVpNXKTqSkdR2iM2ygDwLO1DnAHMh53cmOkLCwaCwQrpmGWApJiYOYDGWBs+c6jABBqI7U8WfngHEzoHmiztoFnEErsRBxgWW68NbNECuQEWFt/F0m67Fh9CThUhJuEEVXsDjdA8LKiMxfKDkSaaE2Ko5fFYoSAN5e1OcIQxcM+DM/eKc5i10NZB4n+wqN628OJbp5nBsi1TeDMjtEGtf0NVK3MnFs5qG3rUY4moBNttD1woeBlsx2gmWi6en+Y3jQZoo46VYGGKJzBjI5MDLWblgvzbzvFxLDs5+BQXxpYWdSkahZ1uEtp3Cyq9bfGg9EIqpb1LPakpiw2u+2mKN5tHAPOVfhiWYuXuepZLwMInoMqfwoO9VNNooqwehvkwZpUT7uaJ0HNePGpL8u9jiT2e/1+/271FFbkcJ1V+Z6GCKH3+BZSrCGcLu2pAV70ARiM721uAEb/+2T1LqyjKi0vUz1/d+GjYrsN8pjPTI8W/bf8nmWr+hUuMNDVlyVUtan7XLNgneZrnhwZqfKA8oeiyu7z9zvgRlP43CIsat3B5d/QfouuDqFqW18OpoLR0pgC+wXBxXPCWFk/tVpfn6z55WTNYBuci/z+Elvv544fpfxuocmKLf3xOPK3rNik/3V/CCgtDiR+iYttkOY198z9jXtgJNi+p8zDf3APyS5sXl7jt+s3bL7f4t4yRAH3zD38uOoo4KOKNUtymbPu1d0C/sv1/dvq+P2vxX/lu+/I1wmh9EbE3/vw+3+tMM1bYVAnjZowjie7givTkqyClDbqYldF5MdjZuNnbkwYxxLCpXnNgjwi3HTUbEyBZQ/AUH2Zjp4//CnaVZTjFzV3IdtTqyV2+02p027ef7dowEjNWlvCAj4OWNB6i8Wn8Z8vOQZ1TbYhJVxS1OzyMdpsaGix+HJhnh8+fPrxHfrMf/j0rpjPzd9To4dLnmWV5owrdrcT5eTwLiGJkoJ7sAhjab7m6lPNyPbLNscK7sOnr2r63LyGtO7wfOPQbLz9FTHK1YTxX0J9+CrMH4MGd3BughdeAPpCB1ZwcAJuYECyTmtGqq8Jc0hZcrVptHZ11aJFFNBrJcGh5r7WJW5NGH9b4vcB3RHuPy+K9LaUxtyHT/9IzD9zv3GbV46vuIemdfWzWJXm6wfu19vp3uv2yz3xy123m5u6yBtv7v+T5cM/GYz7jbsiXm05fvXPFtD4UW+5/+OI4/lgx4o/EnFGpKTFibs0Zm5VVNxNQ+sbae6bF8q8XVxuOOAiUrF0lUYBI81GGNSk2+b4mOO5X375hfvw6ZvPzc/cr9yHT+9b5ud3Yvt7aTJy4oI8/jrXv4WkP5ho/iEvb6hcx5evafj3jYcfW9449gWh76G4OfAZOV3h+CZwVLH/Y+A3nN+R/LvT/PH4eu3hF93+AWsvur8r35k0fuZsY2T8aZsEp5jkf37inEuLIfFFIaMi35Pq0inS+vI8AhZ36YoVd0hIzh0IR4NdHiXNRhSwK8Mf3iF9n5w/v0f/0j8+P3C//vq+hD8QxG+NdlfeceVqUu3TiNzxXVakDCrCfTtC/f+aq8i2YORbt+tFrosoI6xuNm7t+NJ7SR5cJguez4vDl2i3EPd5+6/fwvr02BOE78Dk+Z8a/x0AAP//1TN8dywYAAA=" -> (known after apply)
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_launch_template.worker_internal_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_internal_x86" {
      ~ default_version         = 1 -> (known after apply)
        id                      = "lt-0a23e96f3feb1649c"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "imagebuilder_worker_internal_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 Internal Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9R4WXOjSpr2vSLqP/D5VMTXHTVILEKy3McnWkiglUQkJFvPhIMlJRApwJBa69R/n9Diatvlmu6e6ZvjG5vMd8uHJ5/3xYMipzinrHUs8QOz2RKalkFFW5v0gOO/MGGxzeOgOj7eaRNNkXUEhn3o3TXOT6yNqzot8geGb3KfGp8aLPva6FPjJfYwrcuiTunFNqA0iJINzulfmGVKcB5s8ONdmqe0GS1Xd3/3sqogr5e4YpU8KuI0Xz0w3TClrwwuJVN8oK2IFNuYjYp8ma4+NbR0g38o7pfXNo3GtsZV/dBgGJY5V/DA4Ehgz4sNhmGYuk6egi1Niio94fgpw8eL7fmHZe7qOmGrOmD6/X5fFsEpGPDHSFDOj8O+0Zf7/f6gbwwO66U6mZDRcpD30oiMjxunUuTKQgKZd2hmjiwel914sDjt+bXXcfLEIAtXK/GiSsEBuGR0Hzl6rwXVUo65U0/dg+OXbLlKesvtEXjt3uSLFnT0o2XLKykBhXpYQnckpWMatUyD5KGiprPSzNokLYu24VOZblb951Vm9jvDU3JchZ2tpPXSgzU5tB15vTU1buQaJ7Au8fKYOtsv9QR+SQRUGdmsL2+3E88IqzX5oib2Jpjvqt3R0oVtrdNd7snrJFzsj3pXcBbroJzFrV5iBc8Lhd+rxw5ShdyN2ovVnlulRtip01C1Tl1g4YMjSkbv/rk0dEfzZlG58itiBuPxzDe1hJ70rhb7lT5XkVuYfB/3j+1VQiNQ6bJFQsncLbri6cQ9y1AVooHe1rl9Ke33z4tktxdyGoqlNV/QGNPpF1vijEVe5u7RNHO/FE7qPsICH7qHTjdPeiRP5pW/WuNuVBj5oq8eWhERO4o5Pa7S7SKS918y/t7bEk9z0XMg02w/nWdwPSzXlitgSZvynWLYrafjqN1ypOy4nO9irbaT+JkfuOORbevlqViFXE+yvZSDrlrmPmzx2F4NWvCLYx+pt/TuuWpp61HcL4SRv8yn0smDyJ1Oe5qfBfnhICpdpKeZMgW9Gq0Fjjt1BscjN1lOnq1wysvSsruMxSCC1bw9jDwUq5MWLx+B01H5dTfy0/5In85AeHJVzhLp8v7AYd54fGQ2wbqo/lrhOAloMyo2d2/5jmNBkvjehfODK+eJP5zwwFKk89pkIfNrlbTLjmrJ6WFsdfZ61nHv83XL7+JiAQylpXH7WftemjFFuI2D9E2yxr5KKX46K8LtWpYBTR6YFt2U1+v9dNaIp11Q1ZfKoqsKPDC/3wrVTRlN5sOnga5pE+vxXoyC5T3HYUmQhHbY5tvL7lIKl1KAuViMerwQ3ff4nnDzHujaQjcV+OLeXUpY7MRxr33PS9wyiNohJ3bETtSJxV4YdjtYwPd8vHyfvP80UKD1ODc5Ojf5AUTx1ErlIbSnyET+1OBUBC97HB1k/NREULEVMDQc3/U5VTTRVPY5YqMhMDTBOwFbHqFM4kPB5/BGk6xhJsBRgkIByjEHoYPKeciX02Dsr61MhRDtZwZR5Zjzn6FtAyMjY8NSbYhUMeYOqcZJpa/GdcSXQ+D669ABojlK1lbGPxtuvLAVu2PZ0MeIV2wLuMEI6JZbyvG+PO+13+xlqmvZUxhzdu4g6CBbVaCicvFGO5prNbHFpLJGnITtsmNwQEYcEaGq+mZGd05GingD9MGl5ukAIVXxhVhFiqpcbJ3e8PxsZCowcrlybNUzbaB5p2TuOCVANslxLkMdAVnjp3NtE0/gUD54rnqK16uZZ0/XdqYJgGiSnyUHiNAhQAfbUe5FbTiFeG2fAqEsNLE8WGMyRutERMTbzQUw1ZzJIVrLNrZLy+MOgcZHom2XR2NfcGAIN55YnCyXtEMVdGze9hEv50ZG5sEolvWxSiNSmprT23gOPOKxbVoDegozXzEd2tbEqPJO6sy37a22AbWmxuWA2JwznI4h7w8hiYElqDs/g5Wj2kOY23NzHM+QE4+sMTyZCggcB2xiEjumWgYga7djLt5rRA0cayJ5p4QPXflZs/szpPi1o2htf6QGlsInjkpSaMnAdKGjKWBi5rIIObL3crINbYLCAT3B3BbCIdzZI/6Ix8UOu0knUqBgZ/wiytRpaJTtUKjFiNjUHtsZHNkq4qcDS4hlDVHeQ7xpj+3EdGUYnqZZKPqH2al/gBvvZKD20UZAjjlbNhxVtxV+BN14gmyiDIhvakpvYBCiwqwQfcv3NDHb+6NeHZm9mUf80stIGQtwi/h+BTJ+oCuxrNl2ZroxdBA/8JA6MtcxAWR1wpachcJ+9hNf+cUXurFqpD0RIR8YiB8Yjtf++F4dvnPUWJUyzEsBCISYXCSFajmPssnRcvggUNSDqRANO4fEEokTWZEIT2Rg2VMEc7B3csRp44kIeSh6HCzizYqHCOxMVU0Hm0MVW7IHUM/zOSg4YzCIRr2ROZ4KmkIXpnOwAG/PNNfbg1G9MwnJnXFUhaMS2WNtp7vlPlwnpr050GiMdpDjF5aFZsiZjtGA6sHaDqKTvYGc7wZKW7SsCY8cauvD6SwcJ8TM1Bq5ycQQDkM0stsoA8CzVAm4fdEeSbk+lOcmiTlsy4ZulBwSYmDkfRHYtuk79xxAqI2U8mjm/VMwJjugTtu6PYVQoEfsANN0442RJUIgJsDc+NtI0ETH7AnAITxcJxQrfGewBpyXFdKMKyWIVN4cFwcvi/kIAW8mqjNkQxQPejA8ecc4i10PZRLi/blHtLZnJ5pxmuogV9eBMz1Ea9T211AxM2Nm5qC2zHsxGgMpWqs74ELOy6ZbQDLecLXeIL1qMkSSMlGAigicwowMDRuqVy3nZu87xVg3rcdgX58bWFnUuGoWdbhNSdwsqtV74/5wCBXTfOS5psg1+fsmz99MHB3OFPhkmvOnmeKZT30IHoMqfwj29UONowrTehPkwQpXD9uaxUFNWf6hJ4pdSeB73V6vd7N6CCu8v4yqbFdFGJNbfBPJ5gBOFtZEB09aH/RHty7XB8P/fbJ6G9ZRlZbnoZ69ubBRsdkEecxmhkeK3kt+z7QU7YIW6GvK0wIq6sR9rGmwSvMVm+YUV3lA2H1RZbfx+xVuwwl8bGEatW7Ysi9gv0RXBlCxzO8HU8BwoU+A9YTg/DGhtKwfWq1dGWGWi3mRl9oi15HavZCPYrZ3OlTdk7Rrvj158/vJm2fHZrAJTkV+e9Gt17PJR3X9sNCkxYZ8PLL8LSvW6X/dHgJCij2On+JiE6R5zTwyf2PuKA42r2l19x/MXbINm+d3/X79CuCPW8xLhihgHpm7j6uOAjaqaLPE51nsVt014L9c37+tjp9/Uf4r34YHtk4wIVe2/uzj8P+1wjRvhUGdNGpMGRZvC6ZMS7wMUtKoi20V4Y9H0cYvzAhThiaYSfOaBnmEmcmw2ZgA0+qDgfI0GT5+/lO0rQjDzmvmzMiHVovv9JqC1G7efrdIQHFNWxtMAzYOaNB6icWm8Z/POfp1jTchwUxS1PT8wdpsqGg+/36rHu8+f/34on1jP399Vcy35s8U6+6cZ1GlOWWK7fVEOd6/SoijpGDuTExpmq+Y+lhTvPm+zdCC+fz1TU3fmpeQ5g2edw7NxstfESVMjSn7PdTnN2H+GDS4gXNVxfAM0Hc60IKBY3AFA+JVWlNcvSXMPqXJxabR2tZVixRRQC6VBPuaeStOzApT9rrE7gKyxcx/nhXpZSmNmc9f/5Hif2N+Z9bPDFsxd03z4mfSKs1Xd8xv19O9FvenW+Knm7g313WRN17c/yfLu38yGPM7c0G82jDs8p8toPFRA7r9c4lh2WBLiz8ScYa4JMWROXdvZllUzFVD6ytpbptnyrxcXGbQZyJc0XSZRgHFzUYY1LjTZtiYYZlff/2V+fz13SfpN+Y35vPX13312yux/VmaDB+ZII/f5vq3kPSDsecf8vKKymXGeUvDv2/cfWx55dh3hH6E4urAZvh4geNd4Kii/8fALzi/IvkPp/nj8fXSw8+6/QFrz7q/LV+ZNH5hLH2o/2mTBMcY539+YJxzi8HxWSGjIt/h6twp0vr8PAQmc+6KFbNPcM7sMUOCbR4lzUYU0AvD714hfZuuv71G/9w/vt0xv/32uoQ/EMQvjXZb3nBlalzt0gjf8F1UuAwqzLwfof5/zVR4U1D83u1ykesiyjCtm41rOz73XpwH58mCZfNi/z3aNcRtKP/re1gf7rsc9wOYLPup8d8BAAD//6NuSRpQGAAA" -> (known after apply)
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_spot_fleet_request.workers_external_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_external_x86" {
      ~ client_token                        = "terraform-20210126195126406500000001" -> (known after apply)
      ~ id                                  = "sfr-bc17797b-b6b4-4c79-a53f-db08e1ff691f" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "External worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0195b4ef20679c780" -> null
              - version = "1" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0195b4ef20679c780"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_spot_fleet_request.workers_internal_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_internal_x86" {
      ~ client_token                        = "terraform-20210125184617882600000004" -> (known after apply)
      ~ id                                  = "sfr-9bf7bea8-2d91-4bb1-b1e1-95c308a14496" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "Image Builder internal worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0a23e96f3feb1649c" -> null
              - version = "1" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0a23e96f3feb1649c"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_volume_attachment.composer_external must be replaced
-/+ resource "aws_volume_attachment" "composer_external" {
      ~ id          = "vai-842948316" -> (known after apply)
      ~ instance_id = "i-0654ebbbd69258c54" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_volume_attachment.composer_internal must be replaced
-/+ resource "aws_volume_attachment" "composer_internal" {
      ~ id          = "vai-740566457" -> (known after apply)
      ~ instance_id = "i-02cfe356a7283027d" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 7 to add, 2 to change, 6 to destroy.
```

</details>

*Pusher: @ondrejbudai, Action: `pull_request`*